[{"date": [1, 2], "text": "“Everybody\n is arguing whether or not it is a BAN. Call it what you want, it is \nabout keeping bad people (with bad intentions) out of country!”", "analysis": "Trump\n and his administration have quibbled with the news media’s use of the \nword “ban” to describe the executive order. But Trump himself called it a\n ban.", "topic": "Immigration", "tweet_id": "826774668245946368"}, {"date": [1, 2], "text": "“Do\n you believe it? The Obama Administration agreed to take thousands of \nillegal immigrants from Australia. Why? I will study this dumb deal!”", "analysis": "Trump\n is referring to the estimated 1,250 (not “thousands”) refugees and \nasylum-seekers that the United States, under Obama, agreed to accept \nfrom an Australian detention center. Refugees and asylum-seekers who \narrive illegally by boat in Australia are called “illegal maritime \narrivals.” They can apply for two types of temporary visas, and some may\n qualify to apply for permanent residency.", "topic": "Immigration", "tweet_id": "826774668245946368"}, {"date": [1, 4], "text": "“Wow,\n @FoxNews just reporting big news. Source: 'Official behind unmasking is\n high up. Known Intel official is responsible. Some unmasked.... ..not \nassociated with Russia. Trump team spied on before he was nominated.' If\n this is true, does not get much bigger. Would be sad for U.S.”", "analysis": "Trump\n cited a rather vague Fox News report to allege spying by the Obama \nadministration. But it appears to refers to national-security \nsurvelliance of foreign offcials that picked up references to U.S. \ncitizens. Generally, those identities are masked, but officials can \nrequest the names in order to better understand the significance of the \nintelligence report. ", "topic": "Russia", "tweet_id": "848219027659010051"}, {"date": [1, 4], "text": "“When\n will Sleepy Eyes Chuck Todd and @NBCNews start talking about the Obama \nSURVEILLANCE SCANDAL and stop with the Fake Trump/Russia story?”", "analysis": "The\n CIA concluded in 2016 that Russia intervened in the U.S. presidential \nelection to help elect Trump, an assessment backed up by FBI Director \nJames B. Comey and then-Director of National Intelligence James R. \nClapper Jr. On Jan. 6, the intelligence community released a \ndeclassified report expressing \"high confidence\" in this judgement. \nSenate and House committees led by Republicans have begun their own \ninvestigations, and at least one Republican lawmaker has called for the \nappointment of a special prosecutor. ", "topic": "Russia", "tweet_id": "848153860602507264"}, {"date": [1, 4], "text": "“The\n failing @nytimes finally gets it - \"In places where no insurance \ncompany offers plans, there will be no way for ObamaCare customers to.. \n...use subsidies to buy health plans.\" In other words, Ocare is dead. \nGood things will happen, however, either with Republicans or Dems.”", "analysis": "The\n article cited by Trump noted that the Trump administration has the \npower to take steps that would mitigate the situation that Trump appears\n to celebrate. ", "topic": "Health care", "tweet_id": "848203201094483972"}, {"date": [1, 7], "text": "“I am extremely pleased to see that @CNN has finally been exposed as #FakeNews and garbage journalism. It's about time!”", "analysis": "Unlike the creators of actual fake news, the editors of the retracted CNN article have resigned and been held to account.", "topic": "Miscellaneous", "tweet_id": "881138485905772549"}, {"date": [1, 7], "text": "“Crazy\n Joe Scarborough and dumb as a rock Mika are not bad people, but their \nlow rated show is dominated by their NBC bosses. Too bad!”", "analysis": "According\n to {Ad Week}: \"Morning Joe had a solid quarter in its own right. Not \nonly did it defeat its rival [CNN] New Day in total viewers for the 9th \nstraight quarter, but its 997,000 total viewer average represents a \nquarterly audience record for MSNBC in the 6 – 9 a.m. time period.\" \nAfter Trump attacked the hosts on Twitter, the show broke its ratings \nrecord.", "topic": "Miscellaneous", "tweet_id": "881140479454310401"}, {"date": [1, 7], "text": "“Numerous states are refusing to give information to the very distinguished VOTER FRAUD PANEL. What are they trying to hide?”", "analysis": "States\n refused to turn over voter information to the voting commission over \nconcerns that doing so may violate federal and state privacy laws. Yet \nTrump suggests that states deciding not to share the information are up \nto something nefarious.", "topic": "Election", "tweet_id": "881137079958241280"}, {"date": [1, 8], "text": "Stock\n Market could hit all-time high (again) 22,000 today. Was 18,000 only 6 \nmonths ago on Election Day. Mainstream media seldom mentions!", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\"", "topic": "Economy", "tweet_id": "892366646542782464"}, {"date": [1, 8], "text": "“Only\n the Fake News Media and Trump enemies want me to stop using Social \nMedia (110 million people). Only way for me to get the truth out!”", "analysis": "Polls consistently show that even Trump supporters are alarmed by the president's Twitter habits.", "topic": "Miscellaneous", "tweet_id": "892383242535481344"}, {"date": [1, 9], "text": "“Stock Market up 5 months in a row!”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\"", "topic": "Economy", "tweet_id": "903766326631698432"}, {"date": [1, 10], "text": "“All\n buildings now inspected........for safety. Thank you to the Governor of\n P.R. and to all of those who are working so closely with our First \nResponders. Fantastic job!”", "analysis": "“I’m\n not aware of such inspection. Of course, there are areas of Puerto Rico\n which we haven’t really gotten in contact. Perhaps he was referring to a\n particular set of buildings. I’m not sure,\" said Puerto Rican Gov. Ricardo Rossello.", "topic": "Environment", "tweet_id": "914467502251528192"}, {"date": [1, 10], "text": "“Being\n nice to Rocket Man hasn't worked in 25 years, why would it work now? \nClinton failed, Bush failed, and Obama failed. I won't fail.”", "analysis": "This\n is an odd statement. Trump uses the \"Rocket Man\" nickname for Kim \nJong-Un. It's unclear whether Trump knows that there have been three \nNorth Korean leaders since Bill Clinton's presidency, all with the last \nname Kim. It's a misleading claim that the past three presidents have \n\"all been outplayed by this gentleman.\" It's actually three men in the \nsame Kim family: Kim Il-Sung, Kim Jong-Il and Kim Jong-Un. Clinton, Bush\n and Obama would dispute that they were \"nice\" to North Korean leaders.", "topic": "Foreign policy", "tweet_id": "914565910798782465"}, {"date": [2, 2], "text": "“If\n U.C. Berkeley does not allow free speech and practices violence on \ninnocent people with a different point of view - NO FEDERAL FUNDS?”", "analysis": "This is not how federal funding for public universities works.", "topic": "Miscellaneous", "tweet_id": "827112633224544256"}, {"date": [2, 2], "text": "“Iran\n was on its last legs and ready to collapse until the U.S. came along \nand gave it a life-line in the form of the Iran Deal: $150 billion”", "analysis": "Trump\n always uses too high an estimate, $150 billion, and makes it sound like\n the United States cut a check to Iran. But this was always Iran’s \nmoney. Iran had billions of dollars in assets that were frozen in \nforeign banks around the globe because of international sanctions over \nits nuclear program. The Treasury Department estimated that once Iran \nfulfilled other obligations, it would have about $55 billion left. The \nCentral Bank of Iran said the number was actually $32 billion. And it's a\n stretch to say Iran was \"ready to collapse.”", "topic": "Foreign policy", "tweet_id": "827119326880813056"}, {"date": [2, 3], "text": "“Since\n November 8th, Election Day, the Stock Market has posted $3.2 trillion \nin GAINS and consumer confidence is at a 15 year high.”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\"", "topic": "Economy", "tweet_id": "837256338203881472"}, {"date": [2, 7], "text": "“#FraudNewsCNN #FNN https://t.co/WYUnHjjUjg”", "analysis": "Unlike the creators of actual fake news, the editors of the retracted CNN article have resigned and been held to account.", "topic": "Miscellaneous", "tweet_id": "881503147168071680"}, {"date": [2, 7], "text": "“Stock\n Market at all time high, unemployment at lowest level in years (wages \nwill start going up) and our base has never been stronger!”", "analysis": "This\n is a flip-flop for Trump. Trump equates the rise of the stock market \nsince the election as a demonstration of a good economy. But the stock \nmarket had already been rising for years before he was elected — and he \ncalled it “a big, fat, ugly bubble.”", "topic": "Economy", "tweet_id": "881662619282702338"}, {"date": [3, 2], "text": "“Professional\n anarchists, thugs and paid protesters are proving the point of the \nmillions of people who voted to MAKE AMERICA GREAT AGAIN!”", "analysis": "Trump\n seems to be citing a segment of Sean Hannity’s show, during which \nHannity questioned whether there was a paid effort to galvanize \nprotesters showing up at airports in the wake of Trump’s immigration \nexecutive order. But there’s no evidence there were paid protesters at \nairports. There were reports that a group called “Demand Protest” was \npaying people to protest against Trump on the day of his inauguration, \nbut Snopes.com debunked that claim.", "topic": "Miscellaneous", "tweet_id": "827483841589891073"}, {"date": [3, 2], "text": "“Countries\n charge U.S. companies taxes or tariffs while the U.S. charges them \nnothing or little.We should charge them SAME as they charge us!”", "analysis": "Many\n countries — but not the United States — have a value-added tax, in \nwhich tax is collected at each stage in the production or distribution \nof a product or service. But with refunds, the burden is really paid by \nthe final consumer. Moreover, the VAT also affects domestic producers. \nIn terms of tariffs, it is incorrect the United States charges “nothing \nor little.” The United States imposes tariffs on Chinese goods, but they\n are not as high as Chinese tariffs on U.S. goods.", "topic": "Economy", "tweet_id": "827477947154063361"}, {"date": [3, 3], "text": "“We should start an immediate investigation into @SenSchumer and his ties to Russia and Putin. A total hypocrite!”", "analysis": "Trump\n makes a misleading comparison between Attorney General Jeff Sessions's \nmeetings with Russian Ambassador Sergey Kislyak and Sen. Charles E. \nSchumer's meeting Vladimir Putin at a pu blic event in 2003. Sessions, \nwho was a Trump campaign surrogate, misled Congress by not disclosing \nthat he met with Kislyak on at least two occasions during the 2016 \npresidential campaign, including one private meeting at Sessions's \nSenate office. ", "topic": "Russia", "tweet_id": "837722869106880517"}, {"date": [3, 3], "text": "“I hereby demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it.”", "analysis": "Trump\n makes a misleading comparison between Attorney General Jeff Sessions's \nmeetings with Russian Ambassador Sergey Kislyak and Rep. Nancy Pelosi's \n2010 meeting with then-Russian President Dmitry Medvedev. Sessions, a \nTrump campaign surrogate, misled Congress by not disclosing that he met \nwith Kislyak on at least two occasions during the 2016 presidential \ncampaign, including one private meeting at Sessions's Senate office. \nPelosi and other House leaders met with Medvedev, who brought Kislyak \nand other top Russian officials to the meeting.", "topic": "Russia", "tweet_id": "837770149767827456"}, {"date": [3, 3], "text": "“It is so pathetic that the Dems have still not approved my full Cabinet.”", "analysis": "The\n Senate Democrats did hold up Trump's Cabinet picks at one time. But as \nof Trump's tweet, there were two empty slots; the administration had not\n sent the rest of the paperwork for one and had not sent a nominee to \nfill the other slot. Sen. Marco Rubio tweeted\n the prior evening, on March 2: \"After the votes taken earlier this \nafternoon, the U.S. Senate has now confirmed all of the available \nCabinet nominations.\"", "topic": "Miscellaneous", "tweet_id": "837638488656920576"}, {"date": [3, 4], "text": "“Did Hillary Clinton ever apologize for receiving the answers to the debate? Just asking!”", "analysis": "Trump\n overstates the disclosure about Clinton reportedly getting a single \ndebate question. During the Democratic primaries, a debate was held in \nFlint, Mich., to focus on the water crisis. Donna Brazile, then a CNN \nanalyst, sent an email to the Clinton campaign saying that a woman with a\n rash from lead poisoning was going to ask what Clinton as president \ncould do the help the people of Flint. There’s no indication Clinton was\n told this information, but in any case it’s a pretty obvious question \nfor a debate being held in Flint. ", "topic": "Election", "tweet_id": "848857910297980928"}, {"date": [3, 4], "text": "“.@FoxNews\n from multiple sources: \"There was electronic surveillance of Trump, and\n people close to Trump. This is unprecedented.\" @FBI”", "analysis": "Trump\n cited a Fox News report to allege spying by the Obama administration. \nBut it appears to refers to national-security survelliance of foreign \noffcials that picked up references to U.S. citizens. Generally, those \nidentities are masked, but officials can request the names in order to \nbetter understand the significance of the intelligence report. ", "topic": "Foreign policy", "tweet_id": "848880519458717698"}, {"date": [3, 6], "text": "“We\n need to be smart, vigilant and tough. We need the courts to give us \nback our rights. We need the Travel Ban as an extra level of safety!”", "analysis": "Trump\n tweeted this in response to the deadly attacks on June 3 on the London \nBridge and Borough Market. But this tweet is misleading. The U.K. is not\n among the six countries identified in his \"travel ban,\" or the \nimmigration executive order.", "topic": "Terrorism", "tweet_id": "871143765473406976"}, {"date": [3, 8], "text": "“Business\n is looking better than ever with business enthusiasm at record levels. \nStock Market at an all-time high. That doesn't just happen!”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\"", "topic": "Economy", "tweet_id": "893081237082001409"}, {"date": [3, 9], "text": "“The\n United States is considering, in addition to other options, stopping \nall trade with any country doing business with North Korea.”", "analysis": "This\n is clearly an idle threat, given that China by far is North Korea's \ntrading partner. In 2016, the United States sold $116 billion in goods \nto China and purchased $462 billion, so a sudden cut-off of \"all trade\" \nwould be devastating to the U.S. economy. ", "topic": "Economy", "tweet_id": "904377075049656322"}, {"date": [3, 10], "text": "“It\n is a 'miracle' how fast the Las Vegas Metropolitan Police were able to \nfind the demented shooter and stop him from even more killing!”", "analysis": "The shooter had committed suicide by the time the police arrived at his room.", "topic": "Miscellaneous", "tweet_id": "915326171063242752"}, {"date": [4, 2], "text": "“After\n being forced to apologize for its bad and inaccurate coverage of me \nafter winning the election, the FAKE NEWS @nytimes is still lost!”", "analysis": "The\n Times did not apologize to its subscribers for its coverage of Trump. \nBoth the Times and The Post have seen spikes in audience and \nsubscribers. ", "topic": "Miscellaneous", "tweet_id": "827874208021639168"}, {"date": [4, 2], "text": "“Interesting\n that certain Middle-Eastern countries agree with the ban. They know if \ncertain people are allowed in it's death & destruction!”", "analysis": "Trump\n appears to referring to a news story he posted on his Facebook account —\n that Kuwait had issued “its own Trump-esque visa ban for five \nMuslim-majority countries.” Trump added: “Smart!” But it turned out this\n was fake news. Kuwait “categorically denies these claims,” the \ncountry’s foreign ministry said. Trump’s Facebook post has not been \ntaken down.", "topic": "Immigration", "tweet_id": "827865957750161408"}, {"date": [4, 2], "text": "“What\n is our country coming to when a judge can halt a Homeland Security \ntravel ban and anyone, even with bad intentions, can come into U.S.?”", "analysis": "Trump\n tweeted a number of critical comments about the “so-called judge” who \nhalted the president’s travel ban of citizens from seven Muslim-majority\n countries. The judiciary was established in the U.S. Constitution as a \nthird branch of government (along with the executive and legislative \nbranches), part of the complex system of checks and balances that \nensures the continuation of democracy. Marbury v. Madison, a Supreme \nCourt case decided more than 200 years ago, helped establish the notion \nof judicial review and cemented the notion that the judiciary was equal \nin power to the president and Congress.", "topic": "Immigration", "tweet_id": "827981079042805761"}, {"date": [4, 2], "text": "“Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision”", "analysis": "There\n is little evidence that the ruling halting Trump’s order has allowed \n“very bad and dangerous people” to pour into the country. The practical \neffect of the order was to restore visas and refugee admissions. Being \naccepted as a refugee in the United States is a difficult, lengthy \nprocess. Obtaining a U.S. visa generally requires an in-person \ninterview, unless you are a citizen of one of 38 countries that \nparticipate in the visa-waiver program. Under a 2015 law, however, four \nof the seven countries covered in the ban require even dual citizens to \nhave an in-person interview.", "topic": "Immigration", "tweet_id": "827996357252243456"}, {"date": [4, 3], "text": "“How\n low has President Obama gone to tapp my phones during the very sacred \nelection process. This is Nixon/Watergate. Bad (or sick) guy!”", "analysis": "There\n is no evidence that Obama ordered the wiretapping of Trump's calls. \nTrump seized on reports in the right-leaning media, but even the reports\n cited by the White House did not make this allegation. Fact Checker rating:", "topic": "Election", "tweet_id": "837996746236182529"}, {"date": [4, 3], "text": "“Terrible!\n Just found out that Obama had my 'wires tapped' in Trump Tower just \nbefore the victory. Nothing found. This is McCarthyism!”", "analysis": "There\n is no evidence that Obama ordered the wiretapping of Trump's calls. \nTrump seized on reports in the right-leaning media, but even the reports\n cited by the White House did not make this allegation. Fact Checker rating:", "topic": "Election", "tweet_id": "837989835818287106"}, {"date": [4, 3], "text": "“Is\n it legal for a sitting President to be 'wire tapping' a race for \npresident prior to an election? Turned down by court earlier. A NEW \nLOW!”", "analysis": "There\n is no evidence that Obama ordered the wiretapping of Trump's calls. \nTrump seized on reports in the right-leaning media, but even the reports\n cited by the White House did not make this allegation. Fact Checker rating:", "topic": "Election", "tweet_id": "837993273679560704"}, {"date": [4, 3], "text": "“I'd\n bet a good lawyer could make a great case out of the fact that \nPresident Obama was tapping my phones in October, just prior to \nElection!”", "analysis": "There\n is no evidence that Obama ordered the wiretapping of Trump's calls. \nTrump seized on reports in the right-leaning media, but even the reports\n cited by the White House did not make this allegation. Fact Checker rating:", "topic": "Election", "tweet_id": "837994257566863360"}, {"date": [4, 3], "text": "“Just\n out: The same Russian Ambassador that met Jeff Sessions visited the \nObama White House 22 times, and 4 times last year alone.”", "analysis": "This\n is a misleading comparison. Sessions appears to have misled the Senate \nabout his meetings, while the meetings at the White House were recorded \nin a public log that Trump has now eliminated. ", "topic": "Russia", "tweet_id": "837991759045079040"}, {"date": [4, 3], "text": "“Arnold\n Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired \nby his bad (pathetic) ratings, not by me. Sad end to great show.”", "analysis": "Schwarzenegger\n said he was leaving of his own accord, blaming animus toward Trump for \nthe show's sagging ratings. “You should think about hiring a new joke \nwriter and a fact checker,\" Schwarenegger tweeted back.  ", "topic": "Miscellaneous", "tweet_id": "838016045222854656"}, {"date": [4, 5], "text": "Death spiral!\n'Aetna will exit Obamacare markets in VA in 2018, citing expected losses on INDV plans this year'", "analysis": "The\n Affordable Care Act is not on a \"death spiral\" and is expected to \nremain stable for the foreseeable future, according to the Congressional\n Budget Office.", "topic": "Health care", "tweet_id": "860108914624532480"}, {"date": [4, 6], "text": "“At least 7 dead and 48 wounded in terror attack and Mayor of London says there is 'no reason to be alarmed!'”", "analysis": "Trump\n takes London Mayor Sadiq Khan's comments totally out of context, making\n it seem as though Khan was playing down the deadly attacks on June 3 on\n the London Bridge and Borough Market. Khan said there is \"no reason to \nbe alarmed\" about the increased police presence following the attacks. \nKhan condemned the attacks: \"I am appalled and furious that these \ncowardly terrorists would deliberately target innocent Londoners and \nbystanders enjoying their Saturday night.\" ", "topic": "Terrorism", "tweet_id": "871328428963901440"}, {"date": [4, 7], "text": "“Gas prices are the lowest in the U.S. in over ten years! I would like to see them go even lower.”", "analysis": "Trump\n is walking a fine line here. As our friends at PolitiFact noted, {gas \nprices were lower than anytime since 2005} over July fourth weekend, but\n in fact, when adjusted for inflation, they have been lower than they \nare now at several points over the last ten years. ", "topic": "Economy", "tweet_id": "882327018070790144"}, {"date": [4, 8], "text": "“Toyota\n & Mazda to build a new $1.6B plant here in the U.S.A. and create 4K\n new American jobs. A great investment in American manufacturing! \n....and don't forget that Foxconn will be spending up to 10 billion \ndollars on a top of the line plant/plants in Wisconsin.”", "analysis": "Trump\n keeps taking credit for projects that were long in the works before he \nbecame president. For example, he repeatedly claims credit for Ford’s \ndecision to abandon its plans to open a factory in Mexico and instead \nexpand its Michigan plant. But analysts say Ford’s decision has more to \ndo with the company’s long-term goal — particularly, its plans to invest\n in electric vehicles — than the administration. Foxconn considered \ninvesting in U.S.-based facilities since 2014, though its initial plans \nto invest in Pennsylvania didn't pan out. Trump keeps celebrating the \ncompany's decision, but the Wisconsin Legislature had not yet approved \nthe $3 billion incentives package amid concerns from taxpayers. Fact Checker rating:", "topic": "Jobs", "tweet_id": "893416615504748544"}, {"date": [4, 8], "text": "Retweeted\n @IvankaTrump: \"Since @realDonaldTrump inauguration, over 1 million net \nnew jobs have been created in the American economy! #MAGA”", "analysis": "Job growth in the first six months of Trump's presidency has been slower than the same period of the previous five years.", "topic": "Jobs", "tweet_id": "893615145053716480"}, {"date": [5, 3], "text": "“Is\n it true the DNC would not allow the FBI access to check server or other\n equipment after learning it was hacked? Can that be possible?”", "analysis": "The\n FBI and the Democratic National Committee disagree on whether the FBI \nrequested access to the DNC's servers. FBI Director James Comey \ntestified to the Senate Intelligence Committee that the bureau made \n\"multiple requests at different levels\" to access DNC's servers, but the\n DNC said the FBI never requested access. The DNC ultimately allowed a \nprivate company to review its database and share findings with the FBI.", "topic": "Russia", "tweet_id": "838351476401520640"}, {"date": [5, 3], "text": "“Thank you for the great rallies all across the country. Tremendous support. Make America Great Again!”", "analysis": "The\n size of crowds holding \"March 4 Trump\" rallies varied, from about 30 \npeople in Indianapolis to about 400 in St. Paul, Minn. Some rallies drew\n just as many protesters as supporters. ", "topic": "Miscellaneous", "tweet_id": "838441522546769923"}, {"date": [5, 5], "text": "“Rather\n than causing a big disruption in N.Y.C., I will be working out of my \nhome in Bedminster, N.J. this weekend. Also saves country money!”", "analysis": "The\n White House made it hard for taxpayers to learn much about travel costs\n and there is no evidence that working in New Jersey rather than \nManhattan actually saves much money. ", "topic": "Miscellaneous", "tweet_id": "860479885566980096"}, {"date": [5, 5], "text": "“Of\n course the Australians have better healthcare than we do --everybody \ndoes. ObamaCare is dead! But our healthcare will soon be great.", "analysis": "The\n Affordable Care Act is not on a \"death spiral\" and is expected to \nremain stable for the foreseeable future, according to the Congressional\n Budget Office.", "topic": "Health care", "tweet_id": "860573284462669824"}, {"date": [5, 5], "text": "“Why\n is it that the Fake News rarely reports Ocare is on its last legs and \nthat insurance companies are fleeing for their lives? It's dead!", "analysis": "The\n Affordable Care Act is not on a \"death spiral\" and is expected to \nremain stable for the foreseeable future, according to the Congressional\n Budget Office.", "topic": "Health care", "tweet_id": "860637673744195584"}, {"date": [5, 6], "text": "“Pathetic\n excuse by London Mayor Sadiq Khan who had to think fast on his \"no \nreason to be alarmed\" statement. MSM is working hard to sell it!”", "analysis": "Trump\n doubles down on taking London Mayor Sadiq Khan's comments out of \ncontext, making it seem as though Khan was playing down the deadly \nattacks on June 3 on the London Bridge and Borough Market. Khan said \nthere is \"no reason to be alarmed\" about the increased police presence \nfollowing the attacks. Khan condemned the attacks: \"I am appalled and \nfurious that these cowardly terrorists would deliberately target \ninnocent Londoners and bystanders enjoying their Saturday night.\" ", "topic": "Terrorism", "tweet_id": "871725780535062528"}, {"date": [5, 6], "text": "“People,\n the lawyers and the courts can call it whatever they want, but I am \ncalling it what we need and what it is, a TRAVEL BAN!”", "analysis": "Trump\n now insists that his immigration executive order is a \"travel ban,\" and\n criticized others who used other terms to describe it. But this lacks \ncontext. His own administration repeatedly said the term \"travel ban\" \nmisrepresents the executive order, and insisted that the immigration \norder is not, in fact, a \"travel ban.\" ", "topic": "Terrorism", "tweet_id": "871674214356484096"}, {"date": [5, 6], "text": "“That's\n right, we need a TRAVEL BAN for certain DANGEROUS countries, not some \npolitically correct term that won't help us protect our people!”", "analysis": "Trump\n now insists that his immigration executive order is a \"travel ban,\" and\n criticized others who used other terms to describe it. But this lacks \ncontext. His own administration repeatedly said the term \"travel ban\" \nmisrepresents the executive order, and insisted that the immigration \norder is not, in fact, a \"travel ban.\" ", "topic": "Terrorism", "tweet_id": "871674214356484096"}, {"date": [5, 6], "text": "“The\n Justice Dept. should ask for an expedited hearing of the watered down \nTravel Ban before the Supreme Court - & seek much tougher version!”", "analysis": "Trump\n now insists that his immigration executive order is a \"travel ban,\" and\n criticized others who used other terms to describe it. But this lacks \ncontext. His own administration repeatedly said the term \"travel ban\" \nmisrepresents the executive order, and insisted that the immigration \norder is not, in fact, a \"travel ban.\" Moreover, Trump decided to \nabandon the original version of the \"travel ban,\" or the immigration \nexecutive order. ", "topic": "Terrorism", "tweet_id": "871677472202477568"}, {"date": [5, 6], "text": "“The\n Justice Dept. should have stayed with the original Travel Ban, not the \nwatered down, politically correct version they submitted to S.C.”", "analysis": "Trump\n now insists that his immigration executive order is a \"travel ban,\" and\n criticized others who used other terms to describe it. But this lacks \ncontext. His own administration repeatedly said the term \"travel ban\" \nmisrepresents the executive order, and insisted that the immigration \norder is not, in fact, a \"travel ban.\" Moreover, Trump decided to \nabandon the original version of the \"travel ban,\" or the immigration \nexecutive order. ", "topic": "Terrorism", "tweet_id": "871675245043888128"}, {"date": [5, 10], "text": "“Stock\n Market hits an ALL-TIME high! Unemployment lowest in 16 years! Business\n and manufacturing enthusiasm at highest level in decades!”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" It \nis also a flip-flop to cite an unemployment rate he used to denounce as \nphony.", "topic": "Economy", "tweet_id": "915896809536589824"}, {"date": [5, 10], "text": "“Why\n Isn't the Senate Intel Committee looking into the Fake News Networks in\n OUR country to see why so much of our news is just made up-FAKE!”", "analysis": "Trump appears to associate negative news reports as fake news. but that's not how the First Amendment works. ", "topic": "Miscellaneous", "tweet_id": "915894251967385600"}, {"date": [5, 10], "text": "“Ralph\n Northam,who is running for Governor of Virginia,is fighting for the \nviolent MS-13 killer gangs & sanctuary cities.  Vote Ed Gillespie!”", "analysis": "There are no sanctuary cities in Virginia. Northam does not support MS-13 gangs. ", "topic": "Immigration", "tweet_id": "915894251967385600"}, {"date": [6, 2], "text": "“Any\n negative polls are fake news, just like the CNN, ABC, NBC polls in the \nelection. Sorry, people want border security and extreme vetting.”", "analysis": "This\n odd tweet appeared aimed at reassuring Trump supporters after polls \nfrom CBS News, CNN/ORC, Gallup and Quinnipiac University showed \nmajorities of Americans opposed to the order and its provisions. (Other \npolls indicated support for Trump’s order.) In the 2016 presidential \nelection, while polls played down Trump’s chances of winning the \nelectoral college, most nationwide polls actually were close to mark. \nThe RealClearPolitics average showed Clinton ahead by 2.1 percentage \npoints — exactly the margin she achieved in her popular-vote victory.", "topic": "Miscellaneous", "tweet_id": "828574430800539648"}, {"date": [6, 2], "text": "“The\n failing @nytimes was forced to apologize to its subscribers for the \npoor reporting it did on my election win. Now they are worse!”", "analysis": "The\n Times did not apologize to its subscribers for its coverage of Trump. \nBoth the Times and The Post have seen spikes in audience and \nsubscribers. ", "topic": "Miscellaneous", "tweet_id": "828642511698669569"}, {"date": [6, 3], "text": "“Buy American & hire American are the principals at the core of my agenda, which is: JOBS, JOBS, JOBS!”", "analysis": "Trump\n has a long history of outsourcing a variety of his own products. The \nFact Checker has counted a total of 12 countries where Trump products \nwere manufactured (China, the Netherlands, Mexico, India, Turkey, \nSlovenia, Honduras, Germany, Bangladesh, Indonesia, Vietnam and South \nKorea).", "topic": "Jobs", "tweet_id": "838862131852369922"}, {"date": [6, 3], "text": "“45,000\n construction & manufacturing jobs in the U.S. Gulf Coast region. \n$20 billion investment [by ExxonMobil]. We are already winning again, \nAmerica!”", "analysis": "Trump\n again takes credit for a project long in the works before he became \npresident. ExxonMobil has been planning this since 2013. ", "topic": "Jobs", "tweet_id": "838862312685637640"}, {"date": [6, 5], "text": "“The\n reason I am staying in Bedminster, N. J., a beautiful community, is \nthat staying in NYC is much more expensive and disruptive. Meetings!”", "analysis": "Trump claimed he was at the Trump golf club in Bedminster, N.J., for \"Meetings!\" but an Instagram user captured a photo of him playing golf that day.", "topic": "Miscellaneous", "tweet_id": "860987464114110465"}, {"date": [6, 5], "text": "“Insurance\n companies are fleeing ObamaCare - it is dead. Our healthcare plan will \nlower premiums & deductibles - and be great healthcare!”", "analysis": "The\n Congressional Budget Office analysis of the bill said that premiums \nwould be ten percent lower than projected by 2026, not that they would \nactually be reduced. The main reason is that insurance would become more\n costly for older, sicker Americans and they would drop health \ninsurance, resulting in a pool of younger, healthier people, the CBO \nsaid. ", "topic": "Health care", "tweet_id": "860987464114110465"}, {"date": [6, 5], "text": "“The\n reason I am staying in Bedminster, N. J., a beautiful community, is \nthat staying in NYC is much more expensive and disruptive. Meetings!”", "analysis": "The\n White House made it hard for taxpayers to learn much about travel costs\n and there is no evidence that working in New Jersey rather than \nManhattan actually saves much money. As for meetings, a photo later \nemerged of Trump playing golf at his club. ", "topic": "Miscellaneous", "tweet_id": "860987464114110465"}, {"date": [6, 9], "text": "“We are the highest taxed nation in the world - that will change.”", "analysis": "Trump\n almost never gets this correct. The Pew Research Center, using 2014 \ndata, found that the tax bill for Americans, under various scenarios, is\n below average for developed countries. In 2014, according to \ncomparative tables of the Organization for Economic Cooperation and \nDevelopment (OECD), revenue as a percentage of the gross domestic \nproduct — the broadest measure of the economy — was 26 percent for the \nUnited States. Out of 34 countries, that put the United States in the \nbottom third — and well below the OECD average of 34.4 percent.Fact Checker rating:", "topic": "Taxes", "tweet_id": "905381817695526912"}, {"date": [6, 10], "text": "“Since\n Election Day on November 8, the Stock Market is up more than 25%, \nunemployment is at a 17 year low & companies are coming back to \nU.S.”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" It \nis also a flip-flop to cite an unemployment rate he used to denounce as \nphony.", "topic": "Economy", "tweet_id": "916124754620420097"}, {"date": [7, 2], "text": "“I\n don't know Putin, have no deals in Russia, and the haters are going \ncrazy - yet Obama can make a deal with Iran, #1 in terror, no problem!”", "analysis": "Trump\n now claims he doesn’t know Russian President Vladimir Putin, but in the\n past, he had claimed he had spoken to him. Trump’s assertion he has “no\n deals in Russia” is misleading at best, since Trump has actively \npursued deals there and has relied on Russia investors. As for the \nnuclear agreement with Iran, that agreement was forged with the \nassistance of diplomats from the United Kingdom, France, Germany, China,\n Russia and the European Union. Obama did not negotiate it alone.", "topic": "Russia", "tweet_id": "828939235499638784"}, {"date": [7, 2], "text": "“It\n is a disgrace that my full Cabinet is still not in place, the longest \nsuch delay in the history of our country. Obstruction by Democrats!”", "analysis": "This\n is false. Bill Clinton did not have a cabinet in place until March 11, \nGeorge H.W. Bush had to wait till March 17 and Obama did not get a full \ncabinet until April 28. Trump would not have grounds to complain that at\n this point he has fewer Cabinet members confirmed than his \npredecessors. While Democrats have put up roadblocks, part of the reason\n for the delay is because paperwork has been slow in coming from some of\n Trump’s wealthier nominees.", "topic": "Miscellaneous", "tweet_id": "828939235499638784"}, {"date": [7, 3], "text": "“122\n vicious prisoners, released by the Obama Administration from Gitmo, \nhave returned to the battlefield. Just another terrible decision!\" \n(@realDonaldTrump account)", "analysis": "This\n is false. Only eight former Gitmo detainees \"confirmed of reengaging\" \nin terrorist or insurgent activities were released under Obama, and 113 \nwere released under George W. Bush. Although this tweet, sent at 7:04 \na.m., was immediately called out as false on Twitter, Trump repeated it \non the @POTUS account at 8:03 a.m.  Trump tweeted this on the same day \nfrom @realDonaldTrump and @POTUS. Therefore, we are counting the two \ntweets as separate entries in our database.", "topic": "Miscellaneous", "tweet_id": "839084268991229952"}, {"date": [7, 3], "text": "“122\n vicious prisoners, released by the Obama Administration from Gitmo, \nhave returned to the battlefield. Just another terrible decision!\" \n(@POTUS account)", "analysis": "This\n is false. Only eight former Gitmo detainees \"confirmed of reengaging\" \nin terrorist or insurgent activities were released under Obama, and 113 \nwere released under George W. Bush. Trump first tweeted this at 7:04 \na.m. on the @realDonaldTrump account, and it was immediately called out \nas false on Twitter. But then at 8:03 a.m., he repeated the same tweet \non the @POTUS account. Therefore, we are counting the two tweets as \nseparate entries in our database.", "topic": "Miscellaneous", "tweet_id": "839084268991229952"}, {"date": [7, 5], "text": "“When\n will the Fake Media ask about the Dems dealings with Russia & why \nthe DNC wouldn't allow the FBI to check their server or investigate?”", "analysis": "The\n FBI and the Democratic National Committee disagree on whether the FBI \nrequested access to the DNC's servers. FBI Director James Comey \ntestified to the Senate Intelligence Committee that the bureau made \n\"multiple requests at different levels\" to access DNC's servers, but the\n DNC said the FBI never requested access. The DNC ultimately allowed a \nprivate company to review its database and share findings with the FBI.", "topic": "Russia", "tweet_id": "861177649179373569"}, {"date": [7, 5], "text": "“Republican\n Senators will not let the American people down! ObamaCare premiums and \ndeductibles are way up - it was a lie and it is dead!”", "analysis": "The\n Affordable Care Act is not on a \"death spiral\" and is expected to \nremain stable for the foreseeable future, according to the Congressional\n Budget Office.", "topic": "Health care", "tweet_id": "861201362834665472"}, {"date": [7, 5], "text": "“Rexnord\n of Indiana made a deal during the Obama Administration to move to \nMexico. Fired their employees. Tax product big that's sold in U.S.”", "analysis": "This\n was announced after Trump was elected and when he was making a show of \nsaving jobs at another Indiana company. Yet now he blames Obama. ", "topic": "Jobs", "tweet_id": "861354654856249344"}, {"date": [7, 7], "text": "“Everyone here is talking about why John Podesta refused to give the DNC server to the FBI and the CIA. Disgraceful!”", "analysis": "The\n FBI and the Democratic National Committee disagree on whether the FBI \nrequested access to the DNC's servers. FBI Director James Comey \ntestified to the Senate Intelligence Committee that the bureau made \n\"multiple requests at different levels\" to access DNC's servers, but the\n DNC said the FBI never requested access. The DNC ultimately allowed a \nprivate company to review its database and share findings with the FBI.", "topic": "Election", "tweet_id": "883229270943911936"}, {"date": [7, 8], "text": "“The\n failing @nytimes, which has made every wrong prediction about me \nincluding my big election win (apologized), is totally inept!”", "analysis": "The\n Times did not apologize to its subscribers for its coverage of Trump. \nThe Times has seen spikes in audience and subscribers. ", "topic": "Miscellaneous", "tweet_id": "894508048844279809"}, {"date": [7, 8], "text": "“The\n Trump base is far bigger &  stronger than ever before (despite some\n phony Fake News polling). Look at rallies in Penn, Iowa, Ohio.... and \nWest Virginia. The fact is the Fake News Russian collusion story, record\n Stock Market, border security, military strength, jobs..... Supreme \nCourt pick, economic enthusiasm, deregulation & so much more have \ndriven the Trump base even closer together. Will never change!”", "analysis": "Trump's\n approval rating is the worse for any recent new president, and polls \nincreasingly indicate a decline in support among people who voted for \nhim. ", "topic": "Election", "tweet_id": "894512983384129536"}, {"date": [7, 8], "text": "“Hard to believe that with 24/7 #Fake News on CNN, ABC, NBC, CBS, NYTIMES & WAPO, the Trump base is getting stronger!”", "analysis": "Trump's\n approval rating is the worse for any recent new president, and polls \nincreasingly indicate a decline in support among people who voted for \nhim. ", "topic": "Election", "tweet_id": "894518002795900928"}, {"date": [7, 8], "text": "“Never\n in U.S.history has anyone lied or defrauded voters like Senator Richard\n Blumenthal. He told stories about his Vietnam battles and....conquests,\n how brave he was, and it was all a lie. He cried like a baby and begged\n for forgiveness like a child. Now he judges collusion?”", "analysis": "Blumenthal\n did misrepresent his military service, repeatedly conflating his time \nin the Marine Reserves in Washington, D.C., with those who served \noverseas in Vietnam, and later apologized. But there is no evidence he \never bragged about conquests or battles or that he cried when his \nmisleading statements became public. ", "topic": "Miscellaneous", "tweet_id": "894528885701971970"}, {"date": [7, 10], "text": "“More\n and more people are suggesting that Republicans (and me) should be \ngiven Equal Time on T.V. when you look at the one-sided coverage.”", "analysis": "The\n Fairness Doctrine, which required broadcasters to air contrasting views\n regarding controversial matters of public interest, was repealed in \n1987 during the Reagan administration. The repeal helped foster the rise\n of right-leaning television and radio programs, presumably a \ndevelopment the president supports. ", "topic": "Miscellaneous", "tweet_id": "916635236238274561"}, {"date": [7, 10], "text": "“Bob Corker gave us the Iran Deal, & that's about it.”", "analysis": "Sen. Corker (R-Tenn.) opposed the Iran deal negotiated by President Obama. ", "topic": "Foreign policy", "tweet_id": "916780428253687808"}, {"date": [8, 2], "text": "“My\n daughter Ivanka has been treated so unfairly by @Nordstrom. She is a \ngreat person -- always pushing me to do the right thing! Terrible!”", "analysis": "There\n is no evidence that Nordstrom acted out of political considerations. \nThe company has maintained for months (including in internal emails) \nthat it will base its decisions on sales performance. Internal records \nreviewed by the Wall Street Journal show the sales of Ivanka Trump's \nbrand fell 32 percent at Nordstrom last fiscal year.Fact Checker rating:", "topic": "Miscellaneous", "tweet_id": "829356871848951809"}, {"date": [8, 3], "text": "“LinkedIn\n Workforce Report: January and February were the strongest consecutive \nmonths for hiring since August and September 2015”", "analysis": "Trump\n failed to read the fine print of the LinkedIn Workforce report. The \nnumbers were affected by seasonal hiring. When adjusted for seasonal \nhiring variations, hiring was down 1.3 percent from January to February,\n the first full month of Trump's term. ", "topic": "Economy", "tweet_id": "839448469374894080"}, {"date": [8, 5], "text": "“Director\n Clapper reiterated what everybody, including the fake media already \nknows- there is \"no evidence\" of collusion w/ Russia and Trump.”", "analysis": "Trump\n goes too far in attributing such a comment to James Clapper, the former\n director of national intelligence (DNI). Clapper told the Senate \nJudiciary Committee that he was not aware of evidence showing collusion \nbetween members of the Trump campaign and the Russians. Clapper also \nsaid he was not aware of the FBI's investigation into the collusion \nuntil then-FBI Director James Comey revealed it on March 20, 2017. The \nFBI director has discretion to keep such counterintelligence \ninvestigations closely held, and only notify the DNI when appropriate, \nClapper said.", "topic": "Russia", "tweet_id": "861712617299210240"}, {"date": [8, 9], "text": "“Our\n incredible U.S. Coast Guard saved more than 15,000 lives last week with\n Harvey. Irma could be even tougher. We love our Coast Guard!”", "analysis": "The Coast Guard announced it rescued 11,022 people in its Hurricane Harvey response.", "topic": "Miscellaneous", "tweet_id": "906134333467045888"}, {"date": [8, 10], "text": "“Senator\n Bob Corker 'begged' me to endorse him for re-election in Tennessee. I \nsaid 'NO' and he dropped out (said he could not win without my \nendorsement.”", "analysis": "Todd\n Womack, Corker's chief of staff, disputed each of the claims the \npresident made in his tweets. Trump called Corker early last week and \nasked him to reconsider his decision not to seek reelection, according \nto Womack. He said the president also reaffirmed that he would have \nendorsed Corker had he decided to run again — which, Womack added, was \nnot the first time that Trump had extended such an offer of support.", "topic": "Miscellaneous", "tweet_id": "917026789188399105"}, {"date": [8, 10], "text": "“Our\n country has been unsuccessfully dealing with North Korea for 25 years, \ngiving billions of dollars & getting nothing. Policy didn't work!”", "analysis": "Under\n the Bill Clinton accord with North Korea, between 1995 and 2003 the \nUnited States spent about $400 million supplying the fuel oil to North \nKorea that was required under the deal. An international consortium \nspent about $2.5 billion to replace the North’s plutonium reactor with \ntwo light-water reactors; the project was not completed before the deal \ncollapsed by the money mostly went to South Korean and Japanese \ncompanies, not North Korea. The United States stopped paying food \nassistance to North Korea after 2011, with the exception of $1 million \nin humanitarian aid in January 2017 that was negotiated by outgoing \nSecretary of State John Kerry just before Trump was inaugurated. Total \nfood assistance since 1995 was about $700 million. George W. Bush in \n2007-2008 provided about $150 million in fuel oil when engaged in \nnegotiations. ", "topic": "Foreign policy", "tweet_id": "917172144710103040"}, {"date": [9, 2], "text": "“Sen.Richard\n Blumenthal, who never fought in Vietnam when he said for years he had \n(major lie),now misrepresents what Judge Gorsuch told him?”", "analysis": "Trump\n is wrong that the Connecticut Democrat had misrepresented Gorsuch’s \nremarks. Blumenthal’s account was immediately confirmed by Ron Bonjean, a\n member of the group guiding the judge through his confirmation process \non behalf of the Trump administration. ", "topic": "Miscellaneous", "tweet_id": "829660612452036608"}, {"date": [9, 2], "text": "“Chris\n Cuomo, in his interview with Sen. Blumenthal, never asked him about his\n long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!”", "analysis": "Cuomo’s\n first question to Blumenthal was: “What is your response to the \npresident of the United States saying you should not be believed because\n you misrepresented your military record in the past?” Blumenthal ducked\n the question, but contrary to Trump’s tweet, the issue was raised.", "topic": "Miscellaneous", "tweet_id": "829681034564341760"}, {"date": [9, 3], "text": "“Despite\n what you hear in the press, healthcare is coming along great. We are \ntalking to many groups and it will end in a beautiful picture!”", "analysis": "The\n press is reporting reactions to the replacement plan from lawmakers and\n industry groups from all sides of the political spectrum. Conservative \nand liberal industry groups have opposed the plan, along with Democrats \nand some Republican lawmakers, both moderate and conservative. ", "topic": "Health care", "tweet_id": "839883804315684864"}, {"date": [9, 6], "text": "“Despite so many false statements and lies, total and complete vindication...and WOW, Comey is a leaker!”", "analysis": "The\n FBI's investigation into Russian influence on the election continues, \nso it is not yet a \"vindication.\" Moreover, former FBI James B. Comey \nleaked one unclassified memo about his conversation with Trump, but \nTrump himself revealed these conversations existed in his letter firing \nComey. ", "topic": "Russia", "tweet_id": "873120139222306817"}, {"date": [9, 7], "text": "“Questions\n were asked about why the CIA & FBI had to ask the DNC 13 times for \ntheir SERVER, and were rejected, still don't have it.”", "analysis": "The\n FBI and the Democratic National Committee disagree on whether the FBI \nrequested access to the DNC's servers. FBI Director James Comey \ntestified to the Senate Intelligence Committee that the bureau made \n\"multiple requests at different levels\" to access DNC's servers, but the\n DNC said the FBI never requested access. The DNC ultimately allowed a \nprivate company to review its database and share findings with the FBI.", "topic": "Election", "tweet_id": "884018776391503872"}, {"date": [9, 7], "text": "“Fake\n News said 17 intel agencies when actually 4 (had to apologize). Why did\n Obama do NOTHING when he had info before election?”", "analysis": "On\n Jan. 6, the leadership of the intelligence community --the FBI, \nNational Security Agency, CIA and the Director of National Intelligence \n-- released a declassified report expressing \"high confidence\" in the \nCIA's judgement that Russia had meddled in the U.S. election. Senate and\n House committees led by Republicans have begun their own \ninvestigations, and at least one Republican lawmaker has called for the \nappointment of a special prosecutor. President Obama did confront the \nRussian president before the election and reportedly told him to 'knock \nit off.' The Obama administration also took the intelligence to the \nHouse and Senate leadership in the hope of bipartisan congressional \naction. ", "topic": "Russia", "tweet_id": "884020939264073728"}, {"date": [9, 7], "text": "“Sanctions\n were not discussed at my meeting with President Putin. Nothing will be \ndone until the Ukrainian & Syrian problems are solved!”", "analysis": "Sanctions\n were, indeed, mentioned in the context of election meddling, according \nto Secretary of State Rex Tillerson and Trump spokeswoman Sarah Huckabee\n Sanders.", "topic": "Election", "tweet_id": "884027201804488704"}, {"date": [9, 8], "text": "“My\n first order as President was to renovate and modernize our nuclear \narsenal. It is now far stronger and more powerful than ever before....”", "analysis": "Trump\n indeed gave an order to launch a nuclear posture review, but that is \nstandard procedure for a new administration. (It was not his first \norder, but came seven days after he took office.) But he’s kidding \nhimself — or misleading Americans — that much has changed in the nuclear\n arsenal since he took office in January. President Barack Obama \nactually launched a modernization effort expected to cost as much as $1 \ntrillion, and Trump so far has not deviated from that path. Given the \nexpense, the long manufacturing times and the need for annual \ncongressional appropriations, the timeline for nuclear modernization is \ndecades, not days. Fact Checker rating:", "topic": "Foreign policy", "tweet_id": "895252459152711680"}, {"date": [9, 10], "text": "“Our\n country has been unsuccessfully dealing with North Korea for 25 years, \ngiving billions of dollars & getting nothing. Policy didn't work!”", "analysis": "Under\n the Bill Clinton accord with North Korea, between 1995 and 2003 the \nUnited States spent about $400 million supplying the fuel oil to North \nKorea that was required under the deal. An international consortium \nspent about $2.5 billion to replace the North’s plutonium reactor with \ntwo light-water reactors; the project was not completed before the deal \ncollapsed by the money mostly went to South Korean and Japanese \ncompanies, not North Korea. The United States stopped paying food \nassistance to North Korea after 2011, with the exception of $1 million \nin humanitarian aid in January 2017 that was negotiated by outgoing \nSecretary of State John Kerry just before Trump was inaugurated. Total \nfood assistance since 1995 was about $700 million. George W. Bush in \n2007-2008 provided about $150 million in fuel oil when engaged in \nnegotiations. ", "topic": "Foreign policy", "tweet_id": "917341511754436609"}, {"date": [10, 3], "text": "“GREAT AGAIN: +235,000”", "analysis": "The\n day the Bureau of Labor Statistics released its employment report for \nTrump's first full month in office, Trump retweeted Drudge Report: \n\"GREAT AGAIN: +235,000.\" This was a clear flip-flop from the stance he \nheld for many years prior to this jobs report. He repeatedly questioned \nthe accuracy of BLS employment statistics, and called figures calculated\n by career economists as \"phony.\" White House press secretary Sean \nSpicer was asked about this contradiction at a news briefing after the \nreport’s release. His response: “I talked to the president prior to this\n and he said to quote him very clearly. They may have been phony in the \npast, but it’s very real now.”", "topic": "Jobs", "tweet_id": "840196801009451009"}, {"date": [10, 5], "text": "“The\n Roger Stone report on @CNN is false - Fake News. Have not spoken to \nRoger in a long time - had nothing to do with my decision.”", "analysis": "Two\n days after this tweet, Roger Stone {said in an interview} on \"The \nView\": “I'm not going to contradict the president and I'm not going to \nsay when I spoke to him — but I would say this, I have spoken to him \nvery recently.\"", "topic": "Miscellaneous", "tweet_id": "862290442129461249"}, {"date": [10, 7], "text": "“James Comey leaked CLASSIFIED INFORMATION to the media. That is so illegal! ”", "analysis": "Former\n FBI Director James Comey said that {the president's tweet about \npossible \"tapes\" of their conversations led him to believe there might \nbe corroboration for the memos} that he had written while still FBI \ndirector. Comey took contemporaneous notes following each of his \nmeetings with the president and president-elect, which he shared with \nthe senior leadership of the FBI. Comey intentionally wrote these in a \nway that the information wouldn't be classified.", "topic": "Russia", "tweet_id": "884361623514656769"}, {"date": [10, 7], "text": "“When\n I left Conference Room for short meetings with Japan and other \ncountries, I asked Ivanka to hold seat. Very standard. Angela M agrees!”", "analysis": "The\n administration has proposed eliminating major rules but much has not \nbeen finalized. Meanwhile, 124 regulations with an estimated cost of $32\n billion have been issued  in 2017.  ", "topic": "Economy", "tweet_id": "884374529660903424"}, {"date": [10, 10], "text": "“Why is the NFL getting massive tax breaks while at the same time disrespecting our Anthem, Flag and Country? Change tax law!”", "analysis": "This\n statement needs context. In 2015, the NFL voluntarily gave up \ntax-exempt status. However, the league can still receive the tax breaks \nto build stadiums.", "topic": "Miscellaneous", "tweet_id": "917694644481413120"}, {"date": [11, 2], "text": "“I\n am so proud of my daughter Ivanka. To be abused and treated so badly by\n the media, and to still hold her head so high, is truly wonderful!”", "analysis": "Trump\n exaggerates by saying that Ivanka Trump was \"abused and treated so \nbadly by the media.\" His tweet was referring to news coverage about \nNordstrom dropping her brand. There was no evidence that Nordstrom acted\n out of political considerations, or that news coverage attacked Ivanka \nTrump over the news. The company has maintained for months (including in\n internal emails) that it will base its decisions on sales performance. \nInternal records reviewed by the Wall Street Journal show the sales of \nIvanka Trump's brand fell 32 percent at Nordstrom last fiscal year.", "topic": "Miscellaneous", "tweet_id": "830552079240409089"}, {"date": [11, 6], "text": "“Regulations\n way down. 600,000+ new jobs added. Unemployment down to 4.3%. Business \nand economic enthusiasm way up- record levels!”", "analysis": "Unemployment\n has been steadily declining since its peak in 2010. Moreover, Trump now\n uses data from the Bureau of Labor Statistics unemployment rate to say \nthis, which is a flip-flop from his previous claims dismissing the BLS \nunemployment rate as \"nonsense.\"", "topic": "Jobs", "tweet_id": "873878232264822784"}, {"date": [11, 10], "text": "“Stock\n Market has increased by 5.2 Trillion dollars since the election on \nNovember 8th, a 25% increase. Lowest unemployment in 16 years...”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" It \nis also a flip-flop to cite an unemployment rate he used to denounce as \nphony.", "topic": "Economy", "tweet_id": "918058910673760258"}, {"date": [11, 10], "text": "“It\n would be really nice if the Fake News Media would report the virtually \nunprecedented Stock Market growth since the election. Need tax cuts”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" \nMoreover, the stock market highs were regularly reported by the news \nmedia.", "topic": "Economy", "tweet_id": "918061437750267904"}, {"date": [11, 10], "text": "“With\n all of the Fake News coming out of NBC and the Networks, at what point \nis it appropriate to challenge their License? Bad for country!”", "analysis": "Television networks are not licensed, unlike individual TV stations. ", "topic": "Miscellaneous", "tweet_id": "918112884630093825"}, {"date": [11, 10], "text": "“It\n is about time that Roger Goodell of the NFL is finally demanding that \nall players STAND for our great National Anthem-RESPECT OUR COUNTRY,”", "analysis": "Trump\n insists the NFL Commissioner demands that players stand for the anthem,\n but following his tweet the NFL released a statement noting that \nTrump's commentary \"about the Commissioner’s position on the Anthem is \nnot accurate.” NFL players are encouraged but not required to stand. ", "topic": "Miscellaneous", "tweet_id": "918065431939829760"}, {"date": [11, 10], "text": "“Fake\n @NBCNews made up a story that I wanted a \"tenfold\" increase in our U.S.\n nuclear arsenal. Pure fiction, made up to demean. NBC = CNN!”", "analysis": "Trump\n fired off this tweet after NBC reported he called for a nearly tenfold \nincrease in the U.S. nuclear arsenal during a July meeting. NBC stands \nby its reporting. ", "topic": "Miscellaneous", "tweet_id": "918110279367643137"}, {"date": [12, 2], "text": "“The\n crackdown on illegal criminals is merely the keeping of my campaign \npromise. Gang members, drug dealers & others are being removed!”", "analysis": "Trump\n is referring to the recent arrests of undocumented immigrants convicted\n of crimes (“criminal aliens”). Trump takes credit for fulfilling his \ncampaign promise of cracking down on illegal immigration, but these \narrests are routine. ICE has always targeted dangerous criminals in \nenforcement priorities. The recent arrests, however, did include people \nwho would not have fallen under narrowed enforcement priorities under \nObama. Still, 25 percent of the arrests were of people who had lesser \ncharges and noncriminal convictions and are not the gang members or drug\n dealers that he describes.Fact Checker rating:", "topic": "Immigration", "tweet_id": "830741932099960834"}, {"date": [12, 2], "text": "“While\n on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake \nnews to describe the network. They said technical difficulties!”", "analysis": "This\n is not true. In an interview with Erin Burnett, Sen. Bernie Sanders \n(I-Vt.) made a joke about Trump labeling CNN as “fake news.” After he \nmade the joke, the audio cut off, and CNN cut to a commercial. Upon \nreturning from the commercial, Burnett picked up where they left: \n“Senator, you were just talking — joking — about CNN, fake news.” Then \nSanders went on to criticize Trump’s labeling of CNN as “fake news.”", "topic": "Miscellaneous", "tweet_id": "830751875578355713"}, {"date": [12, 4], "text": "“Great\n win in Kansas last night for Ron Estes, easily winning the \nCongressional race against the Dems, who spent heavily & predicted \nvictory!”", "analysis": "Three\n things in this tweet are false. Estes, seeking a congressional seat \nlong held by Republicans, did not have an easy win, Democrats did not \nspend heavily (Republicans did) and Democrats did not predict victory. ", "topic": "Election", "tweet_id": "852138509355933697"}, {"date": [12, 5], "text": "“Again,\n the story that there was collusion between the Russians & Trump \ncampaign was fabricated by Dems as an excuse for losing the election.”", "analysis": "The\n information on Russian efforts to sway the 2016 election was developed \nby the intelligence community and published in a declassified report, in\n which the agencies said they had \"high confidence\" it was correct. ", "topic": "Russia", "tweet_id": "862998775731818496"}, {"date": [12, 5], "text": "“When\n James Clapper himself, and virtually everyone else with knowledge of \nthe witch hunt, says there is no collusion, when does it end?”", "analysis": "Trump\n goes too far in attributing such a comment to James Clapper, the former\n director of national intelligence (DNI). Clapper told the Senate \nJudiciary Committee that he was not aware of evidence showing collusion \nbetween members of the Trump campaign and the Russians. Clapper also \nsaid he was not aware of the FBI's investigation into the collusion \nuntil then-FBI Director James Comey revealed it on March 20, 2017. The \nFBI director has discretion to keep such counterintelligence \ninvestigations closely held, and only notify the DNI when appropriate, \nClapper said. ", "topic": "Russia", "tweet_id": "863014620516233216"}, {"date": [12, 5], "text": "“China\n just agreed that the U.S. will be allowed to sell beef, and other major\n products, into China once again. This is REAL news!”", "analysis": "China\n had already agreed to allow the sale of U.S. beef under a deal brokered\n by the Obama administration. The only thing new was that a definite \ndate was set for when sales would begin. ", "topic": "Economy", "tweet_id": "863020954427043840"}, {"date": [12, 6], "text": "“Congratulations! 'First New Coal Mine of Trump Era Opens in Pennsylvania'”", "analysis": "Trump\n takes credit for a new mine opening up, but the digging of this coal \nmine began two months before the presidential election. Moreover, these \nmines are for metallurgical coal, which is used to make steel. It's not \nrelevant in the context of the Paris agreement, in which this claim was \nmade, because the agreement has to do with carbon emissions from thermal\n coal, which produces heat and electricity.Fact Checker rating:", "topic": "Jobs", "tweet_id": "874325287143604224"}, {"date": [12, 7], "text": "“ISIS\n is on the run & will soon be wiped out of Syria & Iraq, illegal\n border crossings are way down (75%) & MS 13 gangs are being \nremoved.”", "analysis": "Trump\n is referring to the decline in apprehensions along the Southwest \nborder, from December 2016 through April 2017. Indeed, apprehensions \nhave declined dramatically, despite seasonal trends. While the decline \ncan be attributed in part to his anti-illegal immigration rhetoric on \nthe campaign trail, the numbers are less impressive when you compare \nthem to the first full month under the Trump presidency. From February \n2017 (the first full month of his presidency) through June 2017, \napprehensions only declined 8 percent. Further, apprehensions are \nincreasing again after bottoming out in April. ", "topic": "Immigration", "tweet_id": "885092844511387654"}, {"date": [12, 7], "text": "“My\n son Donald did a good job last night. He was open, transparent and \ninnocent. This is the greatest Witch Hunt in political history. Sad!”", "analysis": "Donald\n Trump Jr. only released the emails facing a pending report on the \ncontent of the emails by the New York Times. Moreover, Trump exaggerates\n by calling the Trump-Russia stories the \"greatest Witch Hunt in \npolitical history.\" For context: The Government Accountability Office \nconcluded that the equivalent of $132 million was spent on independent \nprobes during Bill Clinton's presidency, culminating in the impeachment \ntrial in the Senate that left him in office. ", "topic": "Russia", "tweet_id": "885081181980590084"}, {"date": [12, 7], "text": "“Remember, when you hear the words 'sources say' from the Fake Media, often times those sources are made up and do not exist.”", "analysis": "Trump's\n stance on anonymous sources is inconsistent. He condemns them publicly,\n yet his White House consistently talks to media anonymously. Moreover, \nTrump himself shares stories on Twitter that are based on information \nprovided by anonymous sources.", "topic": "Miscellaneous", "tweet_id": "885084555421634561"}, {"date": [12, 7], "text": "“Why aren't the same standards placed on the Democrats. Look what Hillary Clinton may have gotten away with. Disgraceful!”", "analysis": "While\n there are some similarities between the Hillary Clinton's campaign's \ninteractions with Ukrainians and Trump campaign's interactions with \nRussians, there are {key differences} that make it hard to compare the \ntwo. If Trump is referring to Clinton's handling of classified \ninformation as secretary of state, the FBI found that while she was \n\"extremely careless,\" the agency found no evidence of intentional \nmisconduct.", "topic": "Russia", "tweet_id": "885128373441355777"}, {"date": [12, 7], "text": "“Stock market hits another high with spirit and enthusiasm so positive. Jobs outlook looking very good! #MAGA”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" He \nalso previously dismissed jobs numbers as a phony statistic. ", "topic": "Economy", "tweet_id": "885274148012011520"}, {"date": [12, 7], "text": "“The\n W.H. is functioning perfectly, focused on HealthCare, Tax Cuts/Reform \n& many other things. I have very little time for watching T.V.”", "analysis": "The president routinely live-tweets as he watches cable news.", "topic": "Biographical record", "tweet_id": "885131482397908992"}, {"date": [13, 6], "text": "“2\n million more people just dropped out of ObamaCare. It is in a death \nspiral. Obstructionist Democrats gave up, have no answer = resist!”", "analysis": "The\n Affordable Care Act is not on a \"death spiral\" and is expected to \nremain stable for the foreseeable future, according to the Congressional\n Budget Office.", "topic": "Health care", "tweet_id": "874626492310978564"}, {"date": [13, 6], "text": "“A.G.\n Lynch made law enforcement decisions for political purposes...gave \nHillary Clinton a free pass and protection. Totally illegal!”", "analysis": "There\n are not enough facts to support the allegation in this tweet that \nformer Attorney General Loretta Lynch did something \"totally illegal\" in\n the Clinton email investigation. ", "topic": "Miscellaneous", "tweet_id": "874608587473080320"}, {"date": [13, 9], "text": "“Crooked\n Hillary Clinton blames everybody (and every thing) but herself for her \nelection loss. She lost the debates and lost her direction!”", "analysis": "Credible,\n independent public opinion polls largely found Hillary Clinton won the \nthree debates. In her book, Clinton repeatedly cited mistakes she had \nmade in the race against Trump.", "topic": "Election", "tweet_id": "907930425657626624"}, {"date": [13, 10], "text": "“The\n Democrats ObamaCare is imploding. Massive subsidy payments to their pet\n insurance companies has stopped. Dems should call me to fix!”", "analysis": "The Affordable Care Act is expected to remain stable for the foreseeable future, according to the Congressional Budget Office. ", "topic": "Health care", "tweet_id": "918772522983874561"}, {"date": [14, 2], "text": "“The\n real story here is why are there so many illegal leaks coming out of \nWashington? Will these leaks be happening as I deal on N.Korea etc?”", "analysis": "This\n is a flip-flop for Trump. Before becoming president, Trump heartily \nendorsed WikiLeaks and the release of classified information, \nparticularly about his then-rival Hillary Clinton. During a July 2016 \nnews conference, Trump even called on Russia to hack Clinton’s email \naccount. Now, facing information leaks out of his own administration \n(including information that led to the resignation of national security \nadviser Michael Flynn), Trump decided it’s a bad thing. ", "topic": "Russia", "tweet_id": "831510532318429184"}, {"date": [14, 3], "text": "“JOBS, JOBS, JOBS!”", "analysis": "In\n this tweet, Trump included photos of the Bureau of Labor Statistics's \nemployment report for Trump's first full month in office. This was a \nclear flip-flop from the stance he held for many years prior to this \njobs report. He repeatedly questioned the accuracy of BLS employment \nstatistics, and called figures calculated by career economists as \n\"phony.\" White House press secretary Sean Spicer was asked about this \ncontradiction at a news briefing after the report’s release. His \nresponse: “I talked to the president prior to this and he said to quote \nhim very clearly. They may have been phony in the past, but it’s very \nreal now.”", "topic": "Jobs", "tweet_id": "841665325682827265"}, {"date": [14, 7], "text": "“So\n impt Rep Senators, under leadership of @SenateMajLdr McConnell get \nhealthcare plan approved. After 7yrs of O'Care disaster, must happen! ”", "analysis": "To\n put it in context, the number of people affected by premium increases \nis just one-fourteenth the size of the employment-based health-insurance\n market-- and eight out of ten people in the Obamacare exchanges receive\n subsidies to shield them from premium increases. Moreover, some of the \ninitial steps taken by the Trump administration have helped worsen the \nproblems in the individual insurance market — allowing Trump to create a\n self-fulfilling prophecy.", "topic": "Health care", "tweet_id": "885772254017187840"}, {"date": [14, 8], "text": "“The\n Obstructionist Democrats have given us (or not fixed) some of the worst\n trade deals in World History. I am changing that fast!”", "analysis": "It was actually George H.W. Bush, a Republican, who negotiated the NAFTA deal that Trump hates so much.", "topic": "Trade", "tweet_id": "897048688639574016"}, {"date": [14, 8], "text": "“The\n Obstructionist Democrats have given us (or not fixed) some of the worst\n trade deals in World History. I am changing that fast!”", "analysis": "Many\n trade deals had the support of Republicans. The North American Free \nTrade Agreement, for instance, was negotiated by George H.W. Bush and \nthen approved by Congress with mostly Republican votes. ", "topic": "Economy", "tweet_id": "897048688639574016"}, {"date": [14, 8], "text": "“@Merck\n Pharma is a leader in higher & higher drug prices while at the same\n time taking jobs out of the U.S. Bring jobs back & LOWER PRICES!”", "analysis": "Trump\n attacked Merck because its chief executive quit one of his CEO panels \nafter the president's remarks on Charlottesville. But Merck actually has\n a relatively good record on drug prices. It is one of only a handful of\n big pharmaceutical companies to disclose the amount Merck actually \nreceives for a drug after factoring in rebates and other discounts that \ndrugmakers pay out. ", "topic": "Miscellaneous", "tweet_id": "897218560937922564"}, {"date": [14, 10], "text": "“Very\n proud of my Executive Order which will allow greatly expanded access \nand far lower costs for HealthCare. Millions of people benefit!”", "analysis": "On\n Oct. 12 Trump signed an executive order eliminating cost-sharing \nreduction payments to insurance companies. He claims the order will \nresult in lower costs, but according to a report from the Congressional \nBudget Office, premiums for 2018 would increase by 20% over the CBO's \ncurrent baseline and by 25% over the 2020 projection. Additionally, \nabout 1 million people would lose coverage in 2018. ", "topic": "Health care", "tweet_id": "919162619889704961"}, {"date": [15, 2], "text": "“The real scandal here is that classified information is illegally given out by 'intelligence' like candy. Very un-American!”", "analysis": "This\n is a flip-flop for Trump. Before becoming president, Trump heartily \nendorsed WikiLeaks and the release of classified information, \nparticularly about his then-rival Hillary Clinton. During a July 2016 \nnews conference, Trump even called on Russia to hack Clinton’s email \naccount. Now, facing information leaks out of his own administration \n(including information that led to the resignation of national security \nadviser Michael Flynn), Trump decided it’s a bad thing. ", "topic": "Russia", "tweet_id": "831853862281699331"}, {"date": [15, 2], "text": "“Information\n is being illegally given to the failing @nytimes & @washingtonpost \nby the intelligence community (NSA and FBI?).Just like Russia”", "analysis": "Actually, The Post is doing great. The Times, like The Post, has seen spikes in audience and subscribers.", "topic": "Russia", "tweet_id": "831840306161123328"}, {"date": [15, 3], "text": "“Does\n anybody really believe that a reporter, who nobody ever heard of, \"went\n to his mailbox\" and found my tax returns? @NBCNews  FAKE NEWS!”", "analysis": "The\n reporter in question, David Cay Johnston, has won a Pulitzer Prize and \ncovered Trump when he was in the gambling industry. Johnston says Trump \nused to call him at home.", "topic": "Miscellaneous", "tweet_id": "841966077005463553"}, {"date": [15, 7], "text": "“Stock\n Market hit another all-time high yesterday - despite the Russian hoax \nstory! Also, jobs numbers are starting to look very good!”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\" He \nalso previously dismissed jobs numbers as a phony statistic. Moreover, \nTrump again calls the Russia story a \"hoax\" regardless of any new \ndevelopment, even ones with documented proof (like his son's meeting \nwith a Russian attorney).", "topic": "Economy", "tweet_id": "886261674029854721"}, {"date": [15, 8], "text": "“For\n every CEO that drops out of the Manufacturing Council, I have many to \ntake their place. Grandstanders should not have gone on. JOBS!”", "analysis": "One day later, the chief executives disbanded the panels.", "topic": "Miscellaneous", "tweet_id": "897478270442143744"}, {"date": [15, 9], "text": "“With\n the ridiculous Filibuster Rule in the Senate, Republicans need 60 votes\n to pass legislation, rather than 51. Can't get votes, END NOW!”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "908640949605163010"}, {"date": [15, 9], "text": "“ESPN\n is paying a really big price for its politics (and bad programming). \nPeople are dumping it in RECORD numbers. Apologize for untruth!”", "analysis": "ESPN's\n May 2017 survey {found} that of the viewers who see a political bias on\n the network, \"30 percent actually believe ESPN expresses a conservative\n viewpoint. Most importantly, even those who identify as conservative \n(or Republican) actually rate ESPN’s overall performance higher than \nthose groups had in October\" 2016. Moreover, ESPN was the \"highest-rated\n full-time cable network among Men and Adults aged 18-34, 18-49 and \n25-54,\" it found.", "topic": "Miscellaneous", "tweet_id": "908651641943003136"}, {"date": [15, 9], "text": "“We\n have made more progress in the last nine months against ISIS than the \nObama Administration has made in 8 years.Must be proactive & nasty!”", "analysis": "By\n just about every metric, this is not correct. Obama set up virtually \nall the structure that did the key fighting under Trump, and more land \nwas captured, fighters trained and munitions dropped under Obama than \nunder Trump. The basic plan of attack in 2017 was also developed under \nObama, though Trump appears to have speeded up the tempo. Fact Checker rating:", "topic": "Terrorism", "tweet_id": "908646582807089152"}, {"date": [16, 2], "text": "“Leaking,\n and even illegal classified leaking, has been a big problem in \nWashington for years. Failing @nytimes (and others) must apologize!”", "analysis": "This\n is a flip-flop for Trump. Before becoming president, Trump heartily \nendorsed WikiLeaks and the release of classified information, \nparticularly about his then-rival Hillary Clinton. During a July 2016 \nnews conference, Trump even called on Russia to hack Clinton’s email \naccount. Now, facing information leaks out of his own administration \n(including information that led to the resignation of national security \nadviser Michael Flynn), Trump decided it’s a bad thing. ", "topic": "Russia", "tweet_id": "832197515248275456"}, {"date": [16, 2], "text": "“The spotlight has finally been put on the low-life leakers! They will be caught!”", "analysis": "This\n is a flip-flop for Trump. Before becoming president, Trump heartily \nendorsed WikiLeaks and the release of classified information, \nparticularly about his then-rival Hillary Clinton. During a July 2016 \nnews conference, Trump even called on Russia to hack Clinton’s email \naccount. Now, facing information leaks out of his own administration \n(including information that led to the resignation of national security \nadviser Michael Flynn), Trump decided it’s a bad thing. ", "topic": "Russia", "tweet_id": "832198588201594880"}, {"date": [16, 2], "text": "“Stock\n market hits new high with longest winning streak in decades. Great \nlevel of confidence and optimism - even before tax plan rollout!”", "analysis": "This\n is a flip-flop for Trump. Before he was elected, he dismissed the \nstock-market performance under Obama as “artificial” and “a bubble.\"", "topic": "Economy", "tweet_id": "832191485701451777"}, {"date": [16, 3], "text": "“Great progress on healthcare. Improvements being made - Republicans coming together!”", "analysis": "Not\n exactly. The day of this tweet, the House Budget Committee recommended \nchanges to the GOP health-care bill that reflected concerns among \nconservative critics unhappy with the proposed legislation. Moderate \nRepublicans have also expressed opposition, while deep concerns remain \namong Republicans in the Senate. ", "topic": "Health care", "tweet_id": "842494190990901248"}, {"date": [16, 4], "text": "“I\n did what was an almost an impossible thing to do for a \nRepublican-easily won the Electoral College! Now Tax Returns are brought\n up again?”", "analysis": "This\n is not correct. Every Republican president since Rutherford B. Hayes in\n 1876 won a larger share of the electoral college votes than Trump, with\n the exception of George W. Bush and Richard Nixon. ", "topic": "Election", "tweet_id": "853595628655587334"}, {"date": [16, 4], "text": "“Why\n would I call China a currency manipulator when they are working with us\n on the North Korean problem? We will see what happens!”", "analysis": "This is a flip flop. Throughout the campaign, Trump falsely blamed China for being a “world champion” of devaluing the yuan. ", "topic": "Foreign policy", "tweet_id": "853583417916755968"}, {"date": [16, 6], "text": "“I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt”", "analysis": "Trump\n has said he was going to fire James B. Comey as FBI director even \nbefore Deputy Attorney General Rod Rosenstein recommended it.", "topic": "Russia", "tweet_id": "875701471999864833"}, {"date": [16, 6], "text": "“Great news! #MAGA Rasmussen reports 50% approval index June 16, 2017”", "analysis": "The\n Rasmussen Presidential Tracking poll did show President Trump with a \n50% approval rating on Friday, June 16, but it appears to be an outlier,\n given the other polls show Trump at 40 percent or lower. ", "topic": "Miscellaneous", "tweet_id": "875732813278048256"}, {"date": [16, 7], "text": "“The\n ABC/Washington Post Poll, even though almost 40% is not bad at this \ntime, was just about the most inaccurate poll around election time!”", "analysis": "Independent\n researchers who examined polls from the election season and found that \nthe ABC News/Washington Post poll was among the polls that were closest \nto the final result. Moreover, the poll that Trump was referring to \nfound that his overall approval rating dropped to 36 percent from 42 \npercent, and his disapproval rating rose five points to 58 percent. ", "topic": "Biographical record", "tweet_id": "886588838902206464"}, {"date": [16, 7], "text": "“HillaryClinton\n can illegally get the questions to the Debate & delete 33,000 \nemails but my son Don is being scorned by the Fake News Media?”", "analysis": "Trump\n overstates the disclosure about Clinton reportedly getting a single \ndebate question. During the Democratic primaries, a debate was held in \nFlint, Mich., to focus on the water crisis. Donna Brazile, then a CNN \nanalyst, sent an email to the Clinton campaign saying that a woman with a\n rash from lead poisoning was going to ask what Clinton as president \ncould do the help the people of Flint. There’s no indication Clinton was\n told this information, but in any case it’s a pretty obvious question \nfor a debate being held in Flint. ", "topic": "Election", "tweet_id": "886534810575020032"}, {"date": [16, 8], "text": "“Amazon\n is doing great damage to tax paying retailers. Towns, cities and states\n throughout the U.S. are being hurt - many jobs being lost!”", "analysis": "Amazon\n since April has collected sales taxes on every product it sells in \nevery state that has a tax. Amazon leaves it up to third-party sellers \nto collect state sales tax.", "topic": "Miscellaneous", "tweet_id": "897763049226084352"}, {"date": [16, 8], "text": "“Rather\n than putting pressure on the businesspeople of the Manufacturing \nCouncil & Strategy & Policy Forum, I am ending both. Thank you \nall!”", "analysis": "Trump\n tried to claim that he had disbanded his chief executive panels, but \nthis tweet came after he was told CEOs had quit in response to his \nCharlottesville remarks. ", "topic": "Miscellaneous", "tweet_id": "897869174323728385"}, {"date": [16, 8], "text": "“THANK YOU @MayorGimenez for following the RULE OF LAW! Sanctuary cities make our country LESS SAFE!”", "analysis": "There’s\n no evidence that \"sanctuary\" policies had anything to do with crime \ntrends in Miami-Dade County. Mayor Carlos Gimenez said the county can't \nattribute its drop in crimes just to its reversal of its sanctuary \npolicy. Instead, Gimenez pointed to various efforts the county took to \ndecrease its crime rate using new tactics and neighborhood-based crime \nprevention, such as creating job-training programs for high-crime areas.", "topic": "Immigration", "tweet_id": "897764432369070080"}, {"date": [17, 4], "text": "“The\n super Liberal Democrat in the Georgia Congressioal race tomorrow wants \nto protect criminals, allow illegal immigration and raise taxes!”", "analysis": "Jon\n Ossoff, the Democrat Trump is referring to, supports a comprehensive \nimmigration bill that allows a \"path to legal status\" for undocumented \npeople (excluding felons) living in the country. But he also said he \nsupports strong border security. As PolitiFact found, this is not the same as \"allowing illegal immigration. On taxes, factcheck.org found\n that Ossoff has proposed to simplify the tax code, and that “in order \nto lower tax rates, we can eliminate carve-outs and special treatment in\n the tax code that privilege large organizations at the expense of small\n businesses.”", "topic": "Miscellaneous", "tweet_id": "853964023846588420"}, {"date": [17, 7], "text": "“Most\n politicians would have gone to a meeting like the one Don jr attended \nin order to get info on an opponent. That's politics!”", "analysis": "Ethics\n lawyers and campaign veterans say the sort of encounter between Donald \nTrump Jr. and the Russian attorney {is highly unusual.} ", "topic": "Russia", "tweet_id": "886950594220568576"}, {"date": [17, 8], "text": "“Study\n what General Pershing of the United States did to terrorists when \ncaught. There was no more Radical Islamic Terror for 35 years!”", "analysis": "The\n president repeats a myth that has long been debunked by historians. \nThere is no evidence that Gen. John J. Pershing -- the only American \ngeneral to receive six stars during his lifetime -- committed the war \ncrime of shooting 50 Muslim terrorists after dipping the bullets in \npig's blood. In fact, Pershing de-escalated the conflict because he \nfound that escalating counterterrorism was ineffective during the \nPhilippines insurgency in 1899-1913.", "topic": "Terrorism", "tweet_id": "898254409511129088"}, {"date": [17, 9], "text": "“I\n spoke with President Moon of South Korea last night. Asked him how \nRocket Man is doing. Long gas lines forming in North Korea. Too bad!”", "analysis": "This\n is doubtful. According to analysts in touch with North Korean \nresidents, there were no obvious signs that the heightened sanctions led\n to long lines for gas, {The Washington Post reported.}", "topic": "Foreign policy", "tweet_id": "909384837018112000"}, {"date": [17, 10], "text": "“Any increase in ObamaCare premiums is the fault of the Democrats for giving us a \"product\" that never had a chance of working.”", "analysis": "This\n is misleading. Trump signed an executive order on Oct. 12 ending \ncost-sharing reduction payments to insurance companies. In August, the \nCongressional Budget Office estimated that without CSR payments, \npremiums for 2018 would increase by 20% over the CBO's current baseline \nand by 25% over the 2020 projection. ", "topic": "Health care", "tweet_id": "920408108194783232"}, {"date": [18, 3], "text": "“Germany\n owes vast sums of money to NATO & the United States must be paid \nmore for the powerful, and very expensive, defense it provides to \nGermany!”", "analysis": "Germany\n provides in-kind services for the U.S. bases, and the cost of running \nthem is a pittance of the U.S. militraty bases. Germany owes no money to\n NATO, but has not yet acheived a goal, set for 2026, to spend at least \ntwo percent of its gross domestic product on defense. ", "topic": "Foreign policy", "tweet_id": "843090516283723776"}, {"date": [18, 4], "text": "“The\n weak illegal immigration policies of the Obama Admin. allowed bad MS 13\n gangs to form in cities across U.S. We are removing them fast!”", "analysis": "The\n MS-13 gang far predates Obama, and has been active since the 1980s. \nAccording to the Congressional Research Service in 2005 and 2008, the \ngang had spread across the country since the 1980s. Moreover, the \nImmigration and Customs Enforcement under Trump has been arresting an \nincreasing number of noncriminals, indicating that it's not just the \ngang members that are being targeted by his administration.", "topic": "Immigration", "tweet_id": "854268119774367745"}, {"date": [18, 4], "text": "“Democrat\n Jon Ossoff would be a disaster in Congress. VERY weak on crime and \nillegal immigration, bad for jobs and wants higher taxes. Say NO”", "analysis": "Jon\n Ossoff, the Democrat Trump is referring to, supports a comprehensive \nimmigration bill that allows a \"path to legal status\" for undocumented \npeople (excluding felons) living in the country. But he also said he \nsupports strong border security. As PolitiFact found, this is not the \nsame as \"allowing illegal immigration.\" On taxes, factcheck.org found \nthat Ossoff has proposed to simplify the tax code, and that “in order to\n lower tax rates, we can eliminate carve-outs and special treatment in \nthe tax code that privilege large organizations at the expense of small \nbusinesses.”", "topic": "Miscellaneous", "tweet_id": "854283110191685634"}, {"date": [18, 4], "text": "“Republicans\n must get out today and VOTE in Georgia 6. Force runoff and easy win! \nDem Ossoff will raise your taxes-very bad on crime & 2nd A.”", "analysis": "Jon\n Ossoff, the Democrat Trump is referring to, supports a comprehensive \nimmigration bill that allows a \"path to legal status\" for undocumented \npeople (excluding felons) living in the country. But he also said he \nsupports strong border security. As PolitiFact found, this is not the \nsame as \"allowing illegal immigration.\" On taxes, factcheck.org found \nthat Ossoff has proposed to simplify the tax code, and that “in order to\n lower tax rates, we can eliminate carve-outs and special treatment in \nthe tax code that privilege large organizations at the expense of small \nbusinesses.”", "topic": "Miscellaneous", "tweet_id": "854284952539725828"}, {"date": [18, 4], "text": "#BuyAmericanHireAmerican Watch➡️http://45.wh.gov/npcpYM”", "analysis": "Trump\n now calls for Americans to “buy American, hire American.” But this is \nmisleading. Trump has a long history of outsourcing a variety of his own\n products. The Fact Checker has counted a total of 12 countries where \nTrump products were manufactured (China, the Netherlands, Mexico, India,\n Turkey, Slovenia, Honduras, Germany, Bangladesh, Indonesia, Vietnam and\n South Korea).", "topic": "Jobs", "tweet_id": "854438452661809152"}, {"date": [18, 5], "text": "“With\n all of the illegal acts that took place in the Clinton campaign & \nObama Administration, there was never a special counsel appointed!”", "analysis": "Trump\n repeatedly says he believed Hillary Clinton should face criminal \ncharges for her use of a private email server as secretary of state, and\n that Clinton committed an illegal act. But then-FBI Director James \nComey said his investigators did not find intentional mishandling of \nclassified information, and did not recommend criminal charges.", "topic": "Election", "tweet_id": "865207118785372160"}, {"date": [18, 5], "text": "“This is the single greatest witch hunt of a politician in American history!”", "analysis": "The\n appointment of a special counsel is just the beginning of a process. \nThe Government Accountability Office concluded that the equivalent of \n$132 million was spent on independent probes during Bill Clinton's \npresidency, culminating in the impeachment trial in the Senate that left\n him in office. At this point, it's a bit premature for Trump to make \nthis claim.", "topic": "Russia", "tweet_id": "865173176854204416"}, {"date": [18, 6], "text": "“The\n new Rasmussen Poll, one of the most accurate in the 2016 Election, just\n out with a Trump 50% Approval Rating.That's higher than O's #'s!”", "analysis": "The\n Rasmussen Presidential Tracking poll did show President Trump with a \n50% approval rating on Friday, June 16, but it appears to be an outlier,\n given the other polls show Trump at 40 percent or lower. Moreover, on \nJune 16, 2009, then-President Barack Obama had a 56% approval rating in \nthe Rasmussen. While Rasmussen came close to predicting Hillary \nClinton's margin of victroy in the popular vote -- which Trump has \ndisputed -- the poll also predicted Clinton would win the Electoral \nCollege vote. ", "topic": "Miscellaneous", "tweet_id": "876394578777174021"}, {"date": [18, 6], "text": "“RT @FoxNews: New Poll Shows @POTUS Approval at 50 Percent.”", "analysis": "This\n was not a Fox News poll. The Rasmussen Presidential Tracking poll did \nshow President Trump with a 50% approval rating on Friday, June 16, but \nit appears to be an outlier, given the other polls show Trump at 40 \npercent or lower. ", "topic": "Miscellaneous", "tweet_id": "876552203187736577"}, {"date": [18, 7], "text": "“Fake\n News story of secret dinner with Putin is 'sick.' All G 20 leaders, and\n spouses, were invited by the Chancellor of Germany. Press knew!”", "analysis": "News\n media did not say it was a secret dinner. It was a previously \nundisclosed one-hour meeting, accompanied only by Putin's translator.", "topic": "Russia", "tweet_id": "887279050263285761"}, {"date": [18, 7], "text": "“As I have always said, let ObamaCare fail and then come together and do a great healthcare plan. Stay tuned!”", "analysis": "The\n Affordable Care Act is expected to remain stable for the foreseeable \nfuture, according to the Congressional Budget Office. Moreover, Trump \nonly backed off of his pledge to repeal and replace Obamacare after he \nsupported the failed attempts in both chambers of Congress to push \nthrough the legislation.", "topic": "Health care", "tweet_id": "887280380423938048"}, {"date": [18, 7], "text": "“The\n Senate must go to a 51 vote majority instead of current 60 votes. Even \nparts of full Repeal need 60. 8 Dems control Senate. Crazy!”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill. The various proposals never got more than 49 votes, so Trump's \ncomplaint makes little sense. ", "topic": "Health care", "tweet_id": "887302632687251456"}, {"date": [18, 8], "text": "“The\n Obstructionist Democrats make Security for our country very difficult. \nThey use the courts and associated delay at all times. Must stop!”", "analysis": "The\n judicial system is an equal branch of government, intended by the \nframers to be a check on the executive and legislative branches. ", "topic": "Terrorism", "tweet_id": "898528795308642304"}, {"date": [18, 8], "text": "“Radical\n Islamic Terrorism must be stopped by whatever means necessary! The \ncourts must give us back our protective rights. Have to be tough!”", "analysis": "The\n judicial system is an equal branch of government, intended by the \nframers to be a check on the executive and legislative branches. ", "topic": "Terrorism", "tweet_id": "898531481185689600"}, {"date": [18, 10], "text": "“I\n am supportive of Lamar as a person & also of the process, but I can\n never support bailing out ins co's who have made a fortune w/ O'Care.”", "analysis": "This\n claim is false. Insurance companies have actually lost billions in the \nObamacare exchanges, according to company filings and industry analysts.\n For example, Aetna is on pace to lose $750 million from its \nparticipation in the exchanges — $100 million in 2014, $150 million in \n2015, $300 million in 2016 and more than $200 million in 2017. As a \nresult, it is not participating in 2018, a spokesman said. Humana \nannounced it would leave the exchanges, saying it was too risky after \nlosing $45 million in the individual market in 2017.Fact Checker rating:", "topic": "Health care", "tweet_id": "920645935981613057"}, {"date": [19, 2], "text": "“My\n statement as to what's happening in Sweden was in reference to a story \nthat was broadcast on @FoxNews concerning immigrants & Sweden.”", "analysis": "Trump\n referred to rising crime rates in Sweden, but the country's overall \nrate has fallen in recent years. Sweden has welcomed refugees and \nimmigrants, but Swedish crime experts do not agree that the country's \nimmigration policies are linked to crime.", "topic": "Immigration", "tweet_id": "833435244451753984"}, {"date": [19, 4], "text": "“Despite\n major outside money, FAKE media support and eleven Republican \ncandidates, BIG \"R\" win with runoff in Georgia. Glad to be of help!”", "analysis": "Trump\n took credit for the upcoming runoff election in Georgia's 6th \nCongressional District, even though Republicans in the race distanced \nthemselves from Trump as the election got closer. While the Republicans \navoided an embarrassing loss, it wasn't exactly a BIG \"R\" win that \nRepublican Karen Handel will face Democrat Jon Ossoff in the runoff. ", "topic": "Miscellaneous", "tweet_id": "854547423464759296"}, {"date": [19, 4], "text": "“#BuyAmericanHireAmerican”", "analysis": "Trump\n now calls for Americans to “buy American, hire American.” But this is \nmisleading. Trump has a long history of outsourcing a variety of his own\n products. The Fact Checker has counted a total of 12 countries where \nTrump products were manufactured (China, the Netherlands, Mexico, India,\n Turkey, Slovenia, Honduras, Germany, Bangladesh, Indonesia, Vietnam and\n South Korea).", "topic": "Jobs", "tweet_id": "854793411110588418"}, {"date": [19, 6], "text": "“Big\n day tomorrow in Georgia and South Carolina. ObamaCare is dead. Dems \nwant to raise taxes big! They can only obstruct, no ideas. Vote 'R'”", "analysis": "The\n Affordable Care Act is not \"dead\" and is expected to remain stable for \nthe foreseeable future, according to the Congressional Budget Office.", "topic": "Health care", "tweet_id": "876778344636928000"}, {"date": [19, 6], "text": "“The\n Dems want to stop tax cuts, good healthcare and Border Security.Their \nObamaCare is dead with 100% increases in P's. Vote now for Karen H”", "analysis": "The\n Affordable Care Act is not \"dead\" and is expected to remain stable for \nthe foreseeable future, according to the Congressional Budget Office. He\n appears to be referring to increases in premiums (\"P's\") but \ncherry-picks increases from the higher end of premium spikes. Most \npeople on the exchanges receive tax credits that offset the increases.", "topic": "Health care", "tweet_id": "876778344636928000"}, {"date": [19, 7], "text": "“The\n Republicans never discuss how good their healthcare bill is, & it \nwill get even better at lunchtime.The Dems scream death as OCare dies!”", "analysis": "The Affordable Care Act is expected to remain stable for the foreseeable future, according to the Congressional Budget Office. ", "topic": "Health care", "tweet_id": "887654816507408384"}, {"date": [19, 10], "text": "“The\n Fake News is going crazy with wacky Congresswoman Wilson(D), who was \nSECRETLY on a very personal call, and gave a total lie on content!”", "analysis": "Wilson\n was an invited guest on the speakerphone condolence call between Trump \nand Myeshia Johnson, the widow of Sgt. La David Johnson, a soldier \nkilled in Niger. Moreover, it turned out she did not lie, as her \ndescription of Trump's awkward phrasing was confirmed by White House \nchief of staff John Kelly.", "topic": "Miscellaneous", "tweet_id": "920972261032648705"}, {"date": [19, 10], "text": "“Workers of firm involved with the discredited and Fake Dossier take the 5th.”", "analysis": "While\n the dossier commissioned by Fusion GPS for Democrats contained \nsalacious elements, broad portions have proven to be largely correct.", "topic": "Russia", "tweet_id": "920981920787386368"}, {"date": [20, 2], "text": "“Give\n the public a break - The FAKE NEWS media is trying to say that large \nscale immigration in Sweden is working out just beautifully. NOT!”", "analysis": "Trump\n referred to rising crime rates in Sweden, but the country's overall \nrate has fallen in recent years. Sweden has welcomed refugees and \nimmigrants, but Swedish crime experts do not agree that the country's \nimmigration policies are linked to crime.", "topic": "Immigration", "tweet_id": "833681539997253636"}, {"date": [20, 3], "text": "“James\n Clapper and others stated that there is no evidence Potus colluded with\n Russia. This story is FAKE NEWS and everyone knows it!”", "analysis": "Intelligence\n officials have not focused on Trump's possible involvement in Russian \nefforts to sway the election but on associates of Trump and people \ninvolved in the campaign. Fact Checker rating:", "topic": "Russia", "tweet_id": "843772976151642112"}, {"date": [20, 3], "text": "“The\n Democrats made up and pushed the Russian story as an excuse for running\n a terrible campaign. Big advantage in Electoral College & lost!”", "analysis": "The\n information on Russian efforts to sway the 2016 election was developed \nby the intelligence community and published in a declassified report, in\n which the agencies said they had \"high confidence\" it was correct. Fact Checker rating:", "topic": "Russia", "tweet_id": "843776582825267201"}, {"date": [20, 3], "text": "“The NSA and FBI tell Congress that Russia did not influence electoral process.”", "analysis": "This\n was a strange claim, especially because if you watch the video, \nNational Security Agency director Rogers makes clear that, when asked \nabout whether Russian cyber-actors changed vote tallies in Michigan and \nother states, he replied: “I would highlight we are a foreign \nintelligence organization, not a domestic intelligence organization. So \nit would be fair to say, we are probably not the best organization to \nprovide a more complete answer.” Indeed, when later asked about the \npresidential tweet, FBI director James Comey said it did not reflect \nwhat he and Rogers had said: “It certainly wasn’t our intention to say \nthat today.”Fact Checker rating:", "topic": "Russia", "tweet_id": "843813078076719107"}, {"date": [20, 3], "text": "“FBI Director Comey: fmr. DNI Clapper 'right' to say no evidence of collusion between Russia and Trump Campaign.”", "analysis": "This\n was false. Comey was specifically talking about the Jan. 6 document \nissued by the intelligence agencies — a document that the Trump White \nHouse has largely ignored, except to suggest it was fake. Former \ndirector of national intelligence James Clapper later issued a statement\n saying it was “in the best interest of all Americans” to investigate \npossible Trump-Russia ties.Fact Checker rating:", "topic": "Russia", "tweet_id": "843772976151642112"}, {"date": [20, 3], "text": "“FBI Director Comey refuses to deny he briefed President Obama on calls made by Michael Flynn to Russia.”", "analysis": "Comey\n was very careful not to discuss individuals, such as fired national \nsecurity adviser Michael Flynn. He noted that the listeners were not to \ndraw any unwarranted conclusions from his refusal to comment. But \napparently his warning fell on deaf ears at the White House.Fact Checker rating:", "topic": "Russia", "tweet_id": "843961248811225089"}, {"date": [20, 6], "text": "“Democrat\n Jon Ossoff, who wants to raise your taxes to the highest level and is \nweak on crime and security, doesn't even live in district.”", "analysis": "Jon\n Ossoff, the Democrat Trump is referring to, supports a comprehensive \nimmigration bill that allows a \"path to legal status\" for undocumented \npeople (excluding felons) living in the country. But he also said he \nsupports strong border security. As PolitiFact found, this is not the \nsame as \"allowing illegal immigration.\" On taxes, factcheck.org found \nthat Ossoff has proposed to simplify the tax code, and that “in order to\n lower tax rates, we can eliminate carve-outs and special treatment in \nthe tax code that privilege large organizations at the expense of small \nbusinesses.” Trump is correct that Ossoff did not live in the \ncongressional district. ", "topic": "Miscellaneous", "tweet_id": "877101173412638720"}, {"date": [20, 9], "text": "“I\n would not sign Graham-Cassidy if it did not include coverage of \npre-existing conditions. It does! A great Bill. Repeal & Replace.”", "analysis": "This\n is misleading. Depending on the state, the protection for preexisting \nconditions could be the same under Graham-Cassidy — or people with \ncancer or other serious illnesses could find themselves in a high-risk \npool being charged extraordinarily high premiums.", "topic": "Health care", "tweet_id": "910641701064204288"}, {"date": [20, 10], "text": "“Just\n out report: 'United Kingdom crime rises 13% annually amid spread of \nRadical Islamic terror.' Not good, we must keep America safe!”", "analysis": "This\n tweet caused anger in the United Kingdom, as the statistic is fiction. \nThe report cited by Trump barely mentioned terrorism.", "topic": "Terrorism", "tweet_id": "921323063945453574"}, {"date": [20, 10], "text": "“The budget passed late last night, 51 to 49.”", "analysis": "Trump\n is referring to the nonbinding budget resolution which does not require\n a presidential signature. It's not really a budget. ", "topic": "Miscellaneous", "tweet_id": "921317883321430016"}, {"date": [21, 4], "text": "“No\n matter how much I accomplish during the ridiculous standard of the \nfirst 100 days, & it has been a lot (including S.C.), media will \nkill!”", "analysis": "Trump\n calls the 100-day mark a ridiculous standard but before the election he\n grandly announced a 100-day he titled the \"Contract with the American \nVoter.\" Few of the promises made in that documents have been kept in \nTrump's first 100 days. ", "topic": "Biographical record", "tweet_id": "855373184861962240"}, {"date": [21, 6], "text": "“Democrats\n would do much better as a party if they got together with Republicans \non Healthcare,Tax Cuts,Security. Obstruction doesn't work!”", "analysis": "Trump has not reached out to Democrats on these issues, and often has inflamed tensions with nasty, personal tweets. ", "topic": "Health care", "tweet_id": "877474368661618688"}, {"date": [21, 6], "text": "“Well,\n the Special Elections are over and those that want to MAKE AMERICA \nGREAT AGAIN are 5 and O! All the Fake News, all the money spent = 0”", "analysis": "Actually, Republicans won four special elections and Democrats won one. ", "topic": "Miscellaneous", "tweet_id": "877372660455546880"}, {"date": [21, 9], "text": "“Senator\n Luther Strange has gone up a lot in the polls since I endorsed him a \nmonth ago. Now a close runoff. He will be great in D.C.”", "analysis": "Polling does not support Trump's claim that Luther Strange's chances improved after Trump's endorsement, {PolitiFact found.}", "topic": "Biographical record", "tweet_id": "910992971620864004"}, {"date": [21, 10], "text": "“Keep\n hearing about 'tiny' amount of money spent on Facebook ads. What about \nthe billions of dollars of Fake News on CNN, ABC, NBC & CBS?”", "analysis": "Trump\n received $5.6 billion of free media during the 2016 presidential \ncampaign, more than Hillary Clinton, Bernie Sanders, Ted Cruz, Paul Ryan\n and Marco Rubio combined, according to data from tracking firm \nmediaQuant. ", "topic": "Miscellaneous", "tweet_id": "921829947093733376"}, {"date": [21, 10], "text": "“Lowest unemployment in 17 yrs!”", "analysis": "Trump\n now uses data from the Bureau of Labor Statistics unemployment rate to \nsay this, which is a flip-flop from his previous claims dismissing the \nBLS unemployment rate as \"nonsense.\" ", "topic": "Jobs", "tweet_id": "921888248707846144"}, {"date": [22, 1], "text": "“Had\n a great meeting at CIA Headquarters yesterday, packed house, paid great\n respect to Wall, long standing ovations, amazing people. WIN!”", "analysis": "Trump\n appeared to be responding to criticism of his heavily political speech \nin front of the CIA’s memorial wall. He claimed to have received \nstanding ovations, but he never invited the employees to take a seat. So\n they remained standing the whole time.", "topic": "Biographical record", "tweet_id": "823146987117772800"}, {"date": [22, 1], "text": "“Wow,\n television ratings just out: 31 million people watched the \nInauguration, 11 million more than the very good ratings from 4 years \nago!”", "analysis": "Actually,\n Obama’s ratings in 2009 were 7 million people higher than Trump’s \nnumbers. Second-term inaugurals tend to get lower ratings, so Trump is \ncherry-picking the comparison.", "topic": "Biographical record", "tweet_id": "823151124815507460"}, {"date": [22, 6], "text": "“Why\n did the DNC REFUSE to turn over its Server to the FBI, and still \nhasn't? It's all a big Dem scam and excuse for losing the election!”", "analysis": "The\n DNC did refuse to give direct access to the FBI, but allowed a \nthird-party company to gather information on behalf of the FBI. Former \nFBI director James Comey told Congress FBI technicians got all the \ninformation they needed without requiring possession of the server. ", "topic": "Russia", "tweet_id": "877891129194102785"}, {"date": [22, 6], "text": "“Why\n did Democratic National Committee turn down the DHS offer to protect \nagainst hacks (long prior to election). It's all a big Dem HOAX!”", "analysis": "Trump\n is falsely labeling nonpartisan investigations as made up by Democrats.\n The CIA concluded in 2016 that Russia intervened in the U.S. \npresidential election to help elect Trump, an assessment backed up by \nFBI Director James B. Comey and then-Director of National Intelligence \nJames R. Clapper Jr. On Jan. 6, the intelligence community released a \ndeclassified report expressing \"high confidence\" in this judgement. \nSenate and House committees led by Republicans have begun their own \ninvestigations, and a special prosecutor has been appointed.", "topic": "Russia", "tweet_id": "877889199353077760"}, {"date": [22, 6], "text": "“By\n the way, if Russia was working so hard on the 2016 Election, it all \ntook place during the Obama Admin. Why didn't they stop them?”", "analysis": "Trump\n suggests Russian interference in the 2016 is still open to question, \nbut the three key U.S. intelligence agencies have agreed that Russia did\n seek to manpulate the election results on the instructions of Russian \npresident Vladimir Putin.  ", "topic": "Russia", "tweet_id": "877879361130688512"}, {"date": [22, 6], "text": "“Former\n Homeland Security Advisor Jeh Johnson is latest top intelligence \nofficial to state there was no grand scheme between Trump & Russia.”", "analysis": "Trump\n twists Johnson's {words out of context}. Johnson said in a testimony \nbefore the House Intelligence Committee that he was not aware of any \nadditional information tha what was publicly reported. ", "topic": "Russia", "tweet_id": "877878375045447680"}, {"date": [22, 6], "text": "“As promised, our campaign against the MS-13 gang continues. '@ICEgov Busts 39 MS-13 Members in New York Operation\"'”", "analysis": "Trump\n is indeed ramping up enforcement actions against MS-13, but enforcement\n action so far is a continuation of Operation Community Shield, which \nhas been going on since 2005. While a recent six-week raid was the \nbiggest raid to date against MS-13 members and associates, there's not \nbeen a significant change in deportations yet that Trump promised on the\n campaign. ", "topic": "Immigration", "tweet_id": "878006964072189952"}, {"date": [22, 6], "text": "“I am very supportive of the Senate #HealthcareBill. Look forward to making it really special! Remember, ObamaCare is dead.”", "analysis": "The Affordable Care Act is expected to remain stable for the foreseeable future, according to the Congressional Budget Office. ", "topic": "Health care", "tweet_id": "878019881353871360"}, {"date": [22, 7], "text": "“The\n Failing New York Times foiled U.S. attempt to kill the single most \nwanted terrorist,Al-Baghdadi.Their sick agenda over National Security”", "analysis": "The Times reported off of information that was released by the Pentagon {more than three weeks} before the article ran.", "topic": "Miscellaneous", "tweet_id": "888711488717934592"}, {"date": [22, 7], "text": "“While\n all agree the U. S. President has the complete power to pardon, why \nthink of that when only crime so far is LEAKS against us.FAKE NEWS”", "analysis": "There\n are limits to the president's power to pardon. And legal experts \ndispute whether the president can pardon himself, which was a question \nhis legal team was exploring at the time of this tweet.", "topic": "Russia", "tweet_id": "888724194820857857"}, {"date": [22, 7], "text": "“...What\n about all of the Clinton ties to Russia, including Podesta Company, \nUranium deal, Russian Reset, big dollar speeches etc.”", "analysis": "Trump\n suggests the State Department under Hillary Clinton had sole approval \nauthority on a uranium rights deal with a company largely owned by \nRussia’s nuclear energy agency. But the State Department is one of nine \nagencies in the Committee on Foreign Investments in the United States to\n vet and sign off on all U.S. transactions involving foreign \ngovernments. There is no evidence Clinton herself got involved in the \ndeal personally, and it is highly questionable that this deal even rose \nto the level of the secretary of state. The Nuclear Regulatory \nCommission also needed to approve, and did approve, the transfer.Fact Checker rating:", "topic": "Russia", "tweet_id": "888727293346156546"}, {"date": [22, 7], "text": "“My\n son Donald openly gave his e-mails to the media & authorities \nwhereas Crooked Hillary Clinton deleted (& acid washed) her 33,000 \ne-mails!”", "analysis": "Donald Trump Jr. only released the emails facing a pending report on the content of the emails by the New York Times. ", "topic": "Russia", "tweet_id": "888730468732067841"}, {"date": [22, 7], "text": "“ObamaCare\n is dead and the Democrats are obstructionists, no ideas or votes, only \nobstruction. It is solely up to the 52 Republican Senators!”", "analysis": "The Affordable Care Act is expected to remain stable for the foreseeable future, according to the Congressional Budget Office. ", "topic": "Health care", "tweet_id": "888736256145985536"}, {"date": [22, 9], "text": "“The\n Russia hoax continues, now it's ads on Facebook. What about the totally\n biased and dishonest Media coverage in favor of Crooked Hillary?”", "analysis": "The\n information on Russian efforts to sway the 2016 election was developed \nby the intelligence community and published in a declassified report, in\n which the agencies said they had \"high confidence\" it was correct. ", "topic": "Russia", "tweet_id": "911179462745710593"}, {"date": [22, 9], "text": "“Will\n be in Alabama tonight. Luther Strange has gained mightily since my \nendorsement, but will be very close. He loves Alabama, and so do I!”", "analysis": "Polling does not support Trump's claim that Luther Strange's chances improved after Trump's endorsement, {PolitiFact found.}", "topic": "Biographical record", "tweet_id": "911193223921635335"}, {"date": [23, 4], "text": "“The\n two fake news polls released yesterday, ABC & NBC, while containing\n some very positive info, were totally wrong in General E. Watch!”", "analysis": "Trump\n is wrong about how he characterizes these polls. Both the final \nPost-ABC poll (47-43) and NBC/WSJ poll (44-40) had Clinton ahead by four\n points; both outlets emphasized the four-way result, but also tested \npreferences excluding third-party candidates that showed +3 for Post-ABC\n and +5 for NBC/WSJ. Clinton won the national popular vote by 2.1 \npoints. This level of error is quite good for national pre-election \npolls in the United States. ", "topic": "Election", "tweet_id": "856233279841849344"}, {"date": [23, 4], "text": "“New\n polls out today are very good considering that much of the media is \nFAKE and almost always negative. Would still beat Hillary in \n........popular vote. ABC News/Washington Post Poll (wrong big on \nelection) said almost all stand by their vote on me & 53% said \nstrong leader.”", "analysis": "The\n final Post-ABC pre-election poll showed Clinton winning the popular \nvote by three percentage points in a head-to-head match-up. She won by \n2.1 percentage points. Trump also falsely suggests he won the popular \nvote when in fact he lost it. ", "topic": "Election", "tweet_id": "856233279841849344"}, {"date": [23, 4], "text": "“ObamaCare\n is in serious trouble. The Dems need big money to keep it going - \notherwise it dies far sooner than anyone would have thought.”", "analysis": "The\n Affordable Care Act is not imploding and is expected to remain stable \nfor the foreseeable future, according to the Congressional Budget \nOffice. ", "topic": "Health care", "tweet_id": "856150719656755200"}, {"date": [23, 4], "text": "“The\n Democrats don't want money from budget going to border wall despite the\n fact that it will stop drugs and very bad MS 13 gang members.”", "analysis": "Trump’s\n claim that the wall would halt the flow of drugs is dubious. Experts \nsay that drugs are actually shipped through the border on the underside \nof vehicles that have permits to cross the border in a special lane.", "topic": "Immigration", "tweet_id": "856171332521820165"}, {"date": [23, 4], "text": "“The\n Wall is a very important tool in stopping drugs from pouring into our \ncountry and poisoning our youth (and many others)! If the wall is not \nbuilt, which it will be, the drug situation will NEVER be fixed the way \nit should be!”", "analysis": "Trump’s\n claim that the wall would halt the flow of drugs is dubious. Experts \nsay that drugs are actually shipped through the border on the underside \nof vehicles that have permits to cross the border in a special lane.", "topic": "Immigration", "tweet_id": "856171332521820165"}, {"date": [23, 6], "text": "“I've\n helped pass and signed 38 Legislative Bills, mostly with no Democratic \nsupport, and gotten rid of massive amounts of regulations. Nice!”", "analysis": "As\n of June 27, the president has signed 42 pieces of legislation but it is\n tough categorize them as \"really big.\" Many work toward deregulation \nand dismantling Obamacare. ", "topic": "Miscellaneous", "tweet_id": "878200921980891136"}, {"date": [23, 7], "text": "“As\n the phony Russian Witch Hunt continues, two groups are laughing at this\n excuse for a lost election taking hold, Democrats and Russians!”", "analysis": "The\n information on Russian efforts to sway the 2016 election was developed \nby the intelligence community and published in a declassified report, in\n which the agencies said they had \"high confidence\" it was correct. ", "topic": "Russia", "tweet_id": "889215815022727168"}, {"date": [23, 9], "text": "“Arizona\n had a 116% increase in ObamaCare premiums last year, with deductibles \nvery high. Chuck Schumer sold John McCain a bill of goods. Sad”", "analysis": "This\n is one of Trump’s favorite talking points on Obamacare, yet it’s still \nmisleading. For 2017, the average increase in premiums before subsidies \nwas 25 percent, so he is cherry-picking the highest end of premium \nincreases. Moreover, Trump using data from the Department of Health and \nHuman Services that do not take into account the effect of subsidies, \nwhich shield 84 percent of people in the exchanges from such extreme \npremium hikes. On average, eight out of 10 marketplace enrollees receive\n government premium subsidies, and they are protected from a premium \nincrease (and may even see a decrease) if they stay with a low-cost \nplan.", "topic": "Health care", "tweet_id": "911543222731706368"}, {"date": [23, 9], "text": "“Alaska\n had a 200% plus increase in premiums under ObamaCare, worst in the \ncountry. Deductibles high, people angry! Lisa M comes through.”", "analysis": "This\n is one of Trump’s favorite talking points on Obamacare, yet it’s still \nmisleading. For 2017, the average increase in premiums before subsidies \nwas 25 percent, so he is cherry-picking the highest end of premium \nincreases. Moreover, Trump using data from the Department of Health and \nHuman Services that do not take into account the effect of subsidies, \nwhich shield 84 percent of people in the exchanges from such extreme \npremium hikes. On average, eight out of 10 marketplace enrollees receive\n government premium subsidies, and they are protected from a premium \nincrease (and may even see a decrease) if they stay with a low-cost \nplan.", "topic": "Health care", "tweet_id": "911549099752804357"}, {"date": [23, 9], "text": "“Democrats\n are laughingly saying that McCain had a \"moment of courage.\" Tell that \nto the people of Arizona who were deceived. 116% increase!”", "analysis": "This\n is one of Trump’s favorite talking points on Obamacare, yet it’s still \nmisleading. For 2017, the average increase in premiums before subsidies \nwas 25 percent, so he is cherry-picking the highest end of premium \nincreases. Moreover, Trump using data from the Department of Health and \nHuman Services that do not take into account the effect of subsidies, \nwhich shield 84 percent of people in the exchanges from such extreme \npremium hikes. On average, eight out of 10 marketplace enrollees receive\n government premium subsidies, and they are protected from a premium \nincrease (and may even see a decrease) if they stay with a low-cost \nplan.", "topic": "Health care", "tweet_id": "911717004222091264"}, {"date": [24, 1], "text": "“If\n Chicago doesn’t fix the horrible ‘carnage’ going on, 228 shootings in \n2017 with 42 killings (up 24% from 2016), I will send in the Feds!”", "analysis": "The\n percentage is accurate, per Chicago police. But with only one month of \ndata in 2017, it’s too early to use that statistic to call it “carnage.”\n Trump also said he would “send in the feds,” although federal agencies \nalready work with Chicago police. ", "topic": "Crime", "tweet_id": "823950814163140609"}, {"date": [24, 3], "text": "“Today,\n I was thrilled to announce a commitment of $25 BILLION & 20K \nAMERICAN JOBS over the next 4 years. THANK YOU Charter Communications!”", "analysis": "Trump\n trumpeted the company’s announcement that it would invest $25 billion \nin the United States and hire 20,000 workers over four years, but the \ncompany’s jobs plan was in the works as early as June 2015.", "topic": "Jobs", "tweet_id": "845334323045765121"}, {"date": [24, 4], "text": "“If\n our healthcare plan is approved, you will see real healthcare and \npremiums will start tumbling down. ObamaCare is in a death spiral!”", "analysis": "The\n Affordable Care Act is not imploding and is expected to remain stable \nfor the foreseeable future, according to the Congressional Budget \nOffice. ", "topic": "Health care", "tweet_id": "856557986474491904"}, {"date": [24, 6], "text": "“Democrats\n slam GOP healthcare proposal as Obamacare premiums & deductibles \nincrease by over 100%. Remember keep your doctor, keep your plan?”", "analysis": "Premium\n increases range from single digits in certain states to upwards of 100 \npercent in others, so Trump is using the higher end of the range. \nMoreover, he uses the calculation of premium increases without \nincorporating the impact of tax credits — which most people in the \nexchanges receive. If you take the subsidies into account, the average \nmonthly premium of most people in the individual market exchange goes \ndown, not up", "topic": "Health care", "tweet_id": "878596457741287424"}, {"date": [24, 7], "text": "“The\n Amazon Washington Post fabricated the facts on my ending massive, \ndangerous, and wasteful payments to Syrian rebels fighting Assad.....”", "analysis": "The\n Washington Post is owned by Jeffrey P. Bezos, the founder of Amazon. \nAmazon does not own The Post, but in any case the president’s claims \nabout “no-tax” Amazon are out of date. Amazon used to lobby to keep \nInternet sales free from state taxes, but no more. {As of March,} Amazon\n is collecting sales tax on purchases in every state that has one.", "topic": "Miscellaneous", "tweet_id": "889474780356915206"}, {"date": [24, 7], "text": "“So\n many stories about me in the @washingtonpost are Fake News. They are as\n bad as ratings challenged @CNN. Lobbyist for Amazon and taxes?”", "analysis": "The\n Washington Post is owned by Jeffrey P. Bezos, the founder of Amazon. \nAmazon does not own The Post, but in any case the president’s claims \nabout “no-tax” Amazon are out of date. Amazon used to lobby to keep \nInternet sales free from state taxes, but no more. {As of March,} Amazon\n is collecting sales tax on purchases in every state that has one.", "topic": "Miscellaneous", "tweet_id": "889435104841523201"}, {"date": [24, 7], "text": "“Is\n Fake News Washington Post being used as a lobbyist weapon against \nCongress to keep Politicians from looking into Amazon no-tax monopoly?”", "analysis": "The\n Washington Post is owned by Jeffrey P. Bezos, the founder of Amazon. \nAmazon does not own The Post, but in any case the president’s claims \nabout “no-tax” Amazon are out of date. Amazon used to lobby to keep \nInternet sales free from state taxes, but no more. {As of March,} Amazon\n is collecting sales tax on purchases in every state that has one.", "topic": "Miscellaneous", "tweet_id": "889474780356915206"}, {"date": [24, 9], "text": "“...NFL\n attendance and ratings are WAY DOWN. Boring games yes, but many stay \naway because they love our country. League should back U.S.”", "analysis": "This\n lacks context. The TV audience size for NFL games is down this year, \nbut it’s unclear exactly why, and there is no direct connection to the \nprotests. “Average attendance at regular season NFL games last year was \nthe highest since 2007, when the NFL set an all-time record in \nattendance. The NFL says ticket sales are “on par” with last year,” \naccording to the {Associated Press.} And professional football games \nremain among the most-watched televised events, the AP reported. ", "topic": "Miscellaneous", "tweet_id": "911911385176723457"}, {"date": [24, 9], "text": "“Great\n solidarity for our National Anthem and for our Country. Standing with \nlocked arms is good, kneeling is not acceptable. Bad ratings!”", "analysis": "This\n lacks context. The TV audience size for NFL games is down this year, \nbut it’s unclear exactly why, and there's no direct connection to the \nprotests. “Average attendance at regular season NFL games last year was \nthe highest since 2007, when the NFL set an all-time record in \nattendance. The NFL says ticket sales are “on par” with last year,” \naccording to the {Associated Press.} And professional football games \nremain among the most-watched televised events, the AP reported. ", "topic": "Miscellaneous", "tweet_id": "912018945158402049"}, {"date": [24, 9], "text": "“Alaska, Arizona, Maine and Kentucky are big winners in the Healthcare proposal.”", "analysis": "All would have lost federal funding. ", "topic": "Health care", "tweet_id": "912079629648883712"}, {"date": [25, 2], "text": "“The\n media has not reported that the National Debt in my first month went \ndown by $12 billion vs a $200 billion increase in Obama first mo.”", "analysis": "Trump\n is citing such a narrow window of time that the statistics he’s \npointing to don’t mean very much. The level of debt fluctuates day to \nday and week to week, depending on seasonal changes in growth and when \nthe government makes payments, collects tax revenue, issues new debt and\n other debt matures — making the data very susceptible to \ncherry-picking. Using the same logic, you could claim that after four \ndays in office Trump increased outstanding public debt by more than $10 \nbillion, and that Obama had reduced it by $6 billion.", "topic": "Economy", "tweet_id": "835479283699224576"}, {"date": [25, 3], "text": "“ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE. Do not worry!”", "analysis": "The\n Affordable Care Act is not exploding and is expected to remain stable \nfor the foreseeable future, according to the Congressional Budget \nOffice. ", "topic": "Health care", "tweet_id": "845645916732358656"}, {"date": [25, 4], "text": "“Don't\n let the fake media tell you that I have changed my position on the \nWALL. It will get built and help stop drugs, human trafficking etc.”", "analysis": "There\n is little evidence that human trafficking takes place over the \nU.S.-Mexican border. While human trafficking is a problem in some parts \nof the world, experts say it is relatively limited in the United States,\n especially for sexual exploitation. But in general data is limited on \nthe extent of human trafficking. ", "topic": "Immigration", "tweet_id": "856849388026687492"}, {"date": [25, 6], "text": "“Hillary\n Clinton colluded with the Democratic Party in order to beat Crazy \nBernie Sanders. Is she allowed to so collude? Unfair to Bernie!”", "analysis": "Trump's\n use of 'collude' suggests that DNC conspired to hurt the Sanders \ncampaign. {Despite the DNC email hack which showed the committee \nstrongly preferred Clinton,} there's no evidence that Clinton conspired \nwith the committee to damage the Sanders campaign.", "topic": "Election", "tweet_id": "878946025662296064"}, {"date": [25, 7], "text": "“Ukrainian\n efforts to sabotage Trump campaign - 'quietly working to boost \nClinton.' So where is the investigation A.G. @seanhannity”", "analysis": "Trump\n is referring to efforts by a Ukrainian American operative to expose \nformer Trump campaign chairman Paul Manafort’s ties to the Russian \ngovernment. But the comparison to the Russian probe is overblown and \nfacile, making a similar criminal probe problematic.", "topic": "Russia", "tweet_id": "889788202172780544"}, {"date": [25, 7], "text": "“Attorney\n General Jeff Sessions has taken a VERY weak position on Hillary Clinton\n crimes (where are E-mails & DNC server) & Intel leakers!”", "analysis": "Trump\n {conflates a number of issues here} in his continuing effort to force \nhis attorney general from office because of his anger that Sessions \nfollowed Justice Department guidance and recused himself from the Russia\n probe.", "topic": "Russia", "tweet_id": "889790429398528000"}, {"date": [25, 7], "text": "“Problem\n is that the acting head of the FBI & the person in charge of the \nHillary investigation, Andrew McCabe, got $700,000 from H for wife!”", "analysis": "Andrew\n McCabe, who is now the acting FBI director, became part of the \ninvestigation of Hillary Clinton’s emails long after his wife, Jill \nMcCabe, unsuccessfully ran for a Virginia Senate seat. The political \naction committee of Virginia Gov. Terry McAuliffe (D) gave $452,500 to \nMcCabe, and the state Democratic Party gave her campaign an additional \n$207,788. That was about one-third of the $1.8 million budget for her \ncampaign. McAuliffe is close to Clinton, but there is no evidence she \nknew of the contributions. Moreover, it stretches the imagination that \nMcAuliffe would know that the husband of someone he was supporting in a \nVirginia legislative race was going to be promoted months later to a \nposition of authority in the email case.Fact Checker rating:", "topic": "Miscellaneous", "tweet_id": "889792764363276288"}, {"date": [25, 7], "text": "“Jared\n Kushner did very well yesterday in proving he did not collude with the \nRussians. Witch Hunt. Next up, 11 year old Barron Trump!”", "analysis": "Kushner,\n the president’s son-in-law, gave a lengthy statement explaining his \nside of the story and denying any collusion. That is not Kushner \n“proving he did not collude with the Russians”; the special counsel’s \ninvestigation is still under way.", "topic": "Russia", "tweet_id": "889800510106107904"}, {"date": [25, 7], "text": "“Working\n on major Trade Deal with the United Kingdom. Could be very big & \nexciting. JOBS! The E.U. is very protectionist with the U.S. STOP!”", "analysis": "Britain\n and the United States cannot agree to any trade deal until Britain \nfully exits from the European Union, a process that will not be \ncompleted until March 2019. ", "topic": "Economy", "tweet_id": "889821674987761664"}, {"date": [25, 8], "text": "“Few,\n if any, Administrations have done more in just 7 months than the Trump \nA. Bills passed, regulations killed, border, military, ISIS, SC!”", "analysis": "Trump,\n unlike many presidents in their 7th month, has signed no major \nlegislation. at the time of the tweet, he had signed 55 bills, most of \nwhich were minor. Just among recent presidents, Jimmy Carter, George \nH.W. Bush and Bill Clinton had signed more bills than Trump at this \npoint in their presidencies. ", "topic": "Biographical record", "tweet_id": "901032475111116800"}, {"date": [25, 9], "text": "“The\n issue of kneeling has nothing to do with race. It is about respect for \nour Country, Flag and National Anthem. NFL must respect this!”", "analysis": "NFL\n players who decided to kneel during the anthem prior to the game said \nit was an act of protest against police brutality of black Americans.", "topic": "Miscellaneous", "tweet_id": "912280282224525312"}, {"date": [25, 10], "text": "“...This\n now allows for the passage of large scale Tax Cuts (and Reform), which \nwill be the biggest in the history of our country!”", "analysis": "Trump’s\n tax cut would be nearly 0.9 percent of the gross domestic product, \nmeaning it would be far smaller than President Ronald Reagan’s tax cut \nin 1981, which was 2.89 percent of GDP. Trump’s tax cut, if enacted in \nlaw, would be the eighth largest tax cut — and even smaller than two tax\n cuts passed under Barack Obama. Fact Checker rating:", "topic": "Taxes", "tweet_id": "923150966551171073"}, {"date": [26, 2], "text": "“The\n race for DNC Chairman was, of course, totally 'rigged.' Bernie's guy, \nlike Bernie himself, never had a chance. Clinton demanded Perez!”", "analysis": "Trump\n cites no evidence that the battle for Democratic National Committee \nchair, won narrowly by former Labor Secretary Tom Perez, was rigged. \nIndeed, there is no evidence and Sen. Bernie Sanders (D-Vt.), who backed\n Rep. Keith Ellison (D-Minn.), rejected Trump's claim. \"No, he doesn't \nhave a point,\" Sanders said when asked about the tweet.", "topic": "Miscellaneous", "tweet_id": "835814988686233601"}, {"date": [26, 2], "text": "“Russia\n talk is FAKE NEWS put out by the Dems, and played up by the media, in \norder to mask the big election defeat and the illegal leaks!”", "analysis": "Trump\n is falsely labeling nonpartisan investigations as \"fake news\" hyped by \nDemocrats. The CIA concluded in 2016 that Russia intervened in the U.S. \npresidential election to help elect Trump, an assessment backed up by \nFBI Director James B. Comey and then-Director of National Intelligence \nJames R. Clapper Jr. On Jan. 6, the intelligence community released a \ndeclassified report expressing \"high confidence\" in this judgement. \nSenate and House committees led by Republicans have begun their own \ninvestigations, and at least one Republican lawmaker has called for the \nappointment of a special prosecutor. ", "topic": "Russia", "tweet_id": "835916511944523777"}, {"date": [26, 4], "text": "“First\n the Ninth Circuit rules against the ban & now it hits again on \nsanctuary cities-both ridiculous rulings. See you in the Supreme Court!”", "analysis": "The\n ruling blocking Trump's executive order on santuary cities was issued \nby a U.S. district court judge in San Francisco. It had not yet been \ntaken up by an appeals court.", "topic": "Immigration", "tweet_id": "857177434210304001"}, {"date": [26, 4], "text": "“The\n U.S. recorded its slowest economic growth in five years (2016). GDP up \nonly 1.6%. Trade deficits hurt the economy very badly.”", "analysis": "A\n trade deficit can reduce the gross domestic product, as the balance of \ntrade is part of the GDP formula. But Trump greatly overstates the \nimpact on economic growth. The United States has been running trade \ndeficits for three decades, both when GDP growth was high and when it \nwas low. ", "topic": "Economy", "tweet_id": "857185261029126144"}, {"date": [26, 4], "text": "“Out\n of our very big country, with many choices, does everyone notice that \nboth the 'ban' case and now the 'sanctuary' case is brought in the Ninth\n Circuit, which has a terrible record of being overturned (close to \n80%). They used to call this 'judge shopping!' Messy system.”", "analysis": "San\n Francisco and Santa Clara County, the governments that sued over \nTrump's sanctuary order, are in California. So that's where they would \nneed to file a lawsuit. They also did not get to choose the judge that \nruled against Trump. We have earlier explored the claim about the Ninth \nCircuit being overturned 80 percent. The Ninth Circuit is not the most \noverturned court by the annual reversal rate. It does have a high raw \nnumber of reversals or number of cases on the Supreme Court docket. But \nit also reviews more cases than other circuits, is larger than other \ncircuits and terminates far more cases than other circuits.Fact Checker rating:", "topic": "Immigration", "tweet_id": "857180178736459776"}, {"date": [26, 5], "text": "“Just\n arrived in Italy for the G7. Trip has been very successful. We made and\n saved the USA many billions of dollars and millions of jobs.”", "analysis": "Trump\n signed trade and jobs agreements that might lead to job creation in the\n U.S., but he's counting his chickens before they hatch. As for the \nnumber of jobs, thousands appears to have morphed into millions. But an \n{analysis published by The Washington Post} reported that the U.S. \ncompanies involved would not confirm any specific number of jobs saved \nor supported, suggesting that Trump’s original estimate of “thousands” \nwas more guesswork than reality. Fact Checker rating:", "topic": "Jobs", "tweet_id": "868047480847568896"}, {"date": [26, 7], "text": "“Why\n didn't A.G. Sessions replace Acting FBI Director Andrew McCabe, a Comey\n friend who was in charge of Clinton investigation but got big dollars \n($700,000) for his wife's political run from Hillary Clinton and her \nrepresentatives. Drain the Swamp!”", "analysis": "Andrew\n McCabe, who is now the acting FBI director, became part of the \ninvestigation of Hillary Clinton’s emails long after his wife, Jill \nMcCabe, unsuccessfully ran for a Virginia Senate seat. The political \naction committee of Virginia Gov. Terry McAuliffe (D) gave $452,500 to \nMcCabe, and the state Democratic Party gave her campaign an additional \n$207,788. That was about one-third of the $1.8 million budget for her \ncampaign. McAuliffe is close to Clinton, but there is no evidence she \nknew of the contributions. Moreover, it stretches the imagination that \nMcAuliffe would know that the husband of someone he was supporting in a \nVirginia legislative race was going to be promoted months later to a \nposition of authority in the email case.", "topic": "Miscellaneous", "tweet_id": "890207082926022656"}, {"date": [26, 7], "text": "“Thank you Foxconn, for investing $10 BILLION DOLLARS with the potential for up to 13K new jobs in Wisconsin! MadeInTheUSA”", "analysis": "Trump\n touted Foxconn's investment announcement, but the company considered \ninvesting in U.S.-based facilities since 2014, though its initial plans \nto invest in Pennsylvania didn't pan out. Moreover, the $3 billion \nincentives package offered by Wisconsin to lure Foxconn has not yet been\n approved by the Wisconsin Senate, amid concerns that the state would \nuse taxpayer money for a project that would not generate profit for \nWisconsin until 2042. Fact Checker rating:", "topic": "Jobs", "tweet_id": "890197095151546369"}, {"date": [26, 9], "text": "“Ratings\n for NFL football are way down except before game starts, when people \ntune in to see whether or not our country will be disrespected!”", "analysis": "This\n lacks context. The TV audience size for NFL games is down this year, \nbut it’s unclear exactly why, and there is no direct connection to the \nprotests. “Average attendance at regular season NFL games last year was \nthe highest since 2007, when the NFL set an all-time record in \nattendance. The NFL says ticket sales are “on par” with last year,” \naccording to the {Associated Press.} And professional football games \nremain among the most-watched televised events, the AP reported. ", "topic": "Miscellaneous", "tweet_id": "912624892239077376"}, {"date": [26, 9], "text": "“But\n while Dallas dropped to its knees as a team, they all stood up for our \nNational Anthem. Big progress being made-we all love our country!”", "analysis": "The\n Dallas Cowboys said their act of kneeling and then standing was a \ndirect response to Trump's attacks on players kneeling, and a \"statement\n for equality and as a representation of unity. According to {The \nWashington Post}: \"The Cowboys “tossed around ideas” and sought a \nsolution that promoted unity while satisfying both the group of players \nwho wanted to kneel for the anthem and the group that wanted to stand. \nOnce the compromise was reached, members of the Cowboys’ ownership group\n discussed the plan with representatives of the Cardinals’ ownership, \nthe person with knowledge of the planning said.\"", "topic": "Miscellaneous", "tweet_id": "912629775629418501"}, {"date": [27, 3], "text": "“Why\n isn't the House Intelligence Committee looking into the Bill & \nHillary deal that allowed big Uranium to go to Russia, Russian \nspeech....”", "analysis": "Trump\n repeats a Four Pinocchio claim he used during the campaign. It wasn't a\n \"Bill & Hillary deal\"; the State Department was one of nine \nagencies on a committee that approved the sale of majority of shares of a\n uranium mining company to the Russians. The Nuclear Regulatory \nCommission also separately approved the deal. There's no evidence \nClinton got involved in the deal personally, and it's highly \nquestionable this deal even rose to the level of the secretary of state.Fact Checker rating:", "topic": "Russia", "tweet_id": "846166053663191040"}, {"date": [27, 4], "text": "“Democrats jeopardizing the safety of our troops to bail out their donors from insurance companies.”", "analysis": "Trump\n suggests insurance companies are major backers of Democrats, but \nopensecrets.org says that 68 percent of insurance company contributions \ngo to Republicans. ", "topic": "Health care", "tweet_id": "857604808676708353"}, {"date": [27, 6], "text": "“So\n they caught Fake News CNN cold, but what about NBC, CBS & ABC? What\n about the failing @nytimes & @washingtonpost? They are all Fake \nNews!”", "analysis": "Both\n the Times and The Post have seen spikes in audience and subscribers in \n2017. (The Post announced at the end of 2016 that it is “profitable and \ngrowing.”) Moreover, unlike the creators of actual fake news, the \neditors of the retracted CNN article have resigned and been held to \naccount.", "topic": "Miscellaneous", "tweet_id": "879682547235651584"}, {"date": [27, 6], "text": "“Fake\n News CNN is looking at big management changes now that they got caught \nfalsely pushing their phony Russian stories. Ratings way down!”", "analysis": "This\n is false. Data from Nielsen shows CNN is at a five-year high in total \nviewers for primetime, total day, and those two categories for 25- to \n54-year-olds.", "topic": "Miscellaneous", "tweet_id": "879678356450676736"}, {"date": [27, 7], "text": "“Big progress being made in ridding our country of MS-13 gang members and gang members in general. MAKE AMERICA SAFE AGAIN!”", "analysis": "This\n is an exaggeration. Earlier this year, Immigration and Customs \nEnforcement conducted the largest gang surge to date. While about 1,000 \ngang members or affiliates were arrested, they were not yet deported out\n of the country as of June 2017. Moreover, just 104 were associated with\n MS-13. Still, there has been an increase in the rate of gang \ndeportations in general to El Salvador (where MS-13 gang’s roots are) \nand Salvadoran officials are preparing for more.Fact Checker rating:", "topic": "Immigration", "tweet_id": "890642377131515904"}, {"date": [27, 8], "text": "“With\n Mexico being one of the highest crime Nations in the world, we must \nhave THE WALL. Mexico will pay for it through reimbursement/other.”", "analysis": "A\n {leaked transcript} of Trump's phone call with Mexican President \nEnrique Pena Nieto shows Trump knows Mexico will not pay for the wall. \nTrump told Pena Nieto: \"I am willing to say that we will work it out, \nbut that means it will come out in the wash and that is okay. But you \ncannot say anymore that the United States is going to pay for the wall.\"", "topic": "Immigration", "tweet_id": "901802524981817344"}, {"date": [27, 9], "text": "“With\n one Yes vote in hospital & very positive signs from Alaska and two \nothers (McCain is out), we have the HCare Vote, but not for Friday!”", "analysis": "This\n is false. Sen. Thad Cochran (R-Miss.) was at home in Mississippi \nrecovering from urological issue but he was not hospitalized. He missed \nthe health care vote, but the Graham-Cassidy health bill failed even \nwithout Cochran's vote.", "topic": "Health care", "tweet_id": "913003340451188737"}, {"date": [27, 9], "text": "“We\n will have the votes for Healthcare but not for the reconciliation \ndeadline of Friday, after which we need 60. Get rid of Filibuster Rule!”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "913004378486984704"}, {"date": [27, 9], "text": "“Facebook\n was always anti-Trump.The Networks were always anti-Trump hence,Fake \nNews, @nytimes(apologized) & @WaPo were anti-Trump. Collusion?”", "analysis": "The New York Times did not apologize to its subscribers for its coverage of Trump.", "topic": "Miscellaneous", "tweet_id": "913034591879024640"}, {"date": [27, 9], "text": "“..But\n the people were Pro-Trump! Virtually no President has accomplished what\n we have accomplished in the first 9 months-and economy roaring”", "analysis": "Trump\n has no major legislative achievements to his credit and has signed \nfewer bills than many recent presidents. The economy was already doing \nwell when he became president. ", "topic": "Biographical record", "tweet_id": "913035855509491712"}, {"date": [27, 10], "text": "“It is now commonly agreed, after many months of COSTLY looking, that there was NO collusion between Russia and Trump.”", "analysis": "The congressional investigating committees say they have reached no conclusion on collusion. ", "topic": "Russia", "tweet_id": "923905540291522560"}, {"date": [28, 1], "text": "“Thr\n coverage about me in the @nytimes and the @washingtonpost gas been so \nfalse and angry that the times actually apologized to its..... \n...dwindling subscribers and readers.They got me wrong right from the \nbeginning and still have not changed course, and never will. DISHONEST”", "analysis": "The\n New York Times did not apologize to its subscribers for its coverage of\n Trump. Both the Times and The Post have seen spikes in audience and \nsubscribers. (The Post announced at the end of 2016 that it is \n“profitable and growing.”)", "topic": "Miscellaneous", "tweet_id": "825329757646618624"}, {"date": [28, 3], "text": "“Big\n announcement by Ford today. Major investment to be made in three \nMichigan plants. Car companies coming back to U.S.  JOBS! JOBS! JOBS!”", "analysis": "The\n investment projects announced later that day were in line with the \ncontract Ford negotiated with the United Auto Workers in 2015.", "topic": "Jobs", "tweet_id": "846672219073863681"}, {"date": [28, 3], "text": "“Why\n doesn't Fake News talk about Podesta ties to Russia as covered by \n@FoxNews or money from Russia to Clinton - sale of  Uranium?”", "analysis": "Trump\n repeats a Four Pinocchio claim he used during the campaign. It wasn't a\n \"Bill & Hillary deal\"; the State Department was one of nine \nagencies on a committee that approved the sale of majority of shares of a\n uranium mining company to the Russians. The Nuclear Regulatory \nCommission also separately approved the deal. There's no evidence \nClinton got involved in the deal personally, and it's highly \nquestionable this deal even rose to the level of the secretary of state.Fact Checker rating:", "topic": "Russia", "tweet_id": "846854703183020032"}, {"date": [28, 5], "text": "“I\n suggest that we add more dollars to Healthcare and make it the best \nanywhere. ObamaCare is dead - the Republicans will do much better!”", "analysis": "The\n Affordable Care Act is not dead and is expected to remain stable for \nthe foreseeable future, according to the Congressional Budget Office.", "topic": "Health care", "tweet_id": "868979531641741313"}, {"date": [28, 5], "text": "“The\n massive TAX CUTS/REFORM that I have submitted is moving along in the \nprocess very well, actually ahead of schedule. Big benefits to all!”", "analysis": "The\n White House release a one-page outline about its tax policy proposals, \nbut there is no tax bill that is \"moving along in the process very \nwell.\"", "topic": "Taxes", "tweet_id": "868979531641741313"}, {"date": [28, 6], "text": "“Democrats purposely misstated Medicaid under new Senate bill — actually goes up.”", "analysis": "This\n is quite misleading. He describes the raw increase in Medicaid spending\n under the Senate bill. That is just one part of the picture that omits \nthe fact that if the Senate bill as written by the date of his tweet \nbecomes law, federal spending would be reduced by $772 billion over 10 \nyears, according to the nonpartisan Congressional Budget Office. \nMoreover, 15 million fewer people would be enrolled in the program over \n10 years than would be under current law. Fact Checker rating:", "topic": "Health care", "tweet_id": "880175585418465284"}, {"date": [28, 6], "text": "“The\n #AmazonWashingtonPost, sometimes referred to as the guardian of Amazon \nnot paying internet taxes (which they should) is FAKE NEWS!”", "analysis": "There is no \"internet tax.\" If Trump is referring to sales taxes, the company does collect sales taxes. ", "topic": "Miscellaneous", "tweet_id": "880049704620494848"}, {"date": [28, 7], "text": "“If\n Republicans are going to pass great future legislation in the Senate, \nthey must immediately go to a 51 vote majority, not senseless 60...Even \nthough parts of healthcare could pass at 51, some really good things \nneed 60. So many great future bills & budgets need 60 votes”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "890935044474380288"}, {"date": [28, 9], "text": "“GDP\n was revised upward to 3.1 for last quarter. Many people thought it \nwould be years before that happened. We have just begun!”", "analysis": "This\n is wrong. Quarterly GDP growth topped 3 percent often in Barack Obama's\n presidency, mostly recently 2015. Trump has pledged 4 percent annual \ngrowth, which most economists think is unlikely.", "topic": "Economy", "tweet_id": "913550237377138688"}, {"date": [28, 9], "text": "“Puerto\n Rico is devastated. Phone system, electric grid many roads, gone. FEMA \nand First Responders are amazing. Governor said 'great job!'”", "analysis": "Not\n exactly. Puerto Rico Gov. Ricardo Rosselló said the federal government \nhas \"complied with our petitions in an expedited manner,\" but \"we need \nto do a lot more in order for us to get out of the emergency.\"", "topic": "Environment", "tweet_id": "913549374227181568"}, {"date": [28, 10], "text": "“JFK Files are released, long ahead of schedule!”", "analysis": "A\n law signed by President George H.W. Bush in 1992 mandated that all \nrecords be released by Oct. 26, 2017. So the release was not ahead of \nschedule -- and many are still secret.", "topic": "Miscellaneous", "tweet_id": "924414387343028224"}, {"date": [28, 10], "text": "“While\n not at all presidential I must point out that the Sloppy Michael Moore \nShow on Broadway was a TOTAL BOMB and was forced to close. Sad!”", "analysis": "Actually, the show had a 12-week limited engagement and closed on time. ", "topic": "Miscellaneous", "tweet_id": "924400308834455552"}, {"date": [29, 3], "text": "“Remember\n when the failing @nytimes apologized to its subscribers, right after \nthe election, because their coverage was so wrong. Now worse!”", "analysis": "The New York Times did not apologize to its subscribers for its coverage of Trump.", "topic": "Miscellaneous", "tweet_id": "847056211006631936"}, {"date": [29, 6], "text": "“Our\n new American Energy Policy will unlock MILLIONS of jobs & TRILLIONS\n in wealth. We are on the cusp of a true energy REVOLUTION.”", "analysis": "Trump's\n soon-to-arrive revolutionary policy is one that most experts don't \nforsee. {Led by the hydraulic fracturing techniques, the United States \nand the rest of the world have been in the midst of an energy \nrevolution, but that began nearly 15 years ago.} ", "topic": "Environment", "tweet_id": "880564232588107779"}, {"date": [29, 7], "text": "“If\n a new HealthCare Bill is not approved quickly, BAILOUTS for Insurance \nCompanies and BAILOUTS for Members of Congress will end very soon!”", "analysis": "President\n Trump is misusing the term “bailout.” Insurance companies don’t make \nmoney through cost-sharing — they are being paid back for money they’ve \nalready spent on behalf of people who purchased their health plans. \nMembers of Congress also did not get \"bailouts\" when they were moved \nonto the Obamacare exchanges. The president either doesn’t understand \nthe process or is being purposely misleading.Fact Checker rating:", "topic": "Health care", "tweet_id": "891334415347060736"}, {"date": [29, 7], "text": "“In\n other words, Russia was against Trump in the 2016 Election - and why \nnot, I want strong military & low oil prices. Witch Hunt! (Retweeted\n @foxandfriends Firm behind anti-Trump dossier also worked for Russia, \nSenate witness says)”", "analysis": "The\n information on Russian efforts to sway the 2016 election was developed \nby the intelligence community and published in a declassified report, in\n which the agencies said they had \"high confidence\" it was correct. ", "topic": "Russia", "tweet_id": "891253798500487168"}, {"date": [29, 7], "text": "“U.S. Stock Market up almost 20% since Election!”", "analysis": "This\n is a flip-flop for Trump. Trump equates the rise of the stock market \nsince the election as a demonstration of a good economy. But the stock \nmarket had already been rising for years before he was elected — and he \ncalled it “a big, fat, ugly bubble.”", "topic": "Economy", "tweet_id": "891343645529567232"}, {"date": [29, 7], "text": "“The\n very outdated filibuster rule must go. Budget reconciliation is killing\n R's in Senate. Mitch M, go to 51 Votes NOW and WIN. IT'S TIME!”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "891259245106278400"}, {"date": [29, 7], "text": "“Republicans\n in the Senate will NEVER win if they don't go to a 51 vote majority \nNOW. They look like fools and are just wasting time......”", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "891260230876659713"}, {"date": [29, 10], "text": "“All of this 'Russia' talk right when the Republicans are making their big push for historic Tax Cuts & Reform.”", "analysis": "Trump’s\n tax cut would be nearly 0.9 percent of the gross domestic product, \nmeaning it would be far smaller than President Ronald Reagan’s tax cut \nin 1981, which was 2.89 percent of GDP. Trump’s tax cut, if enacted in \nlaw, would be the eighth largest tax cut — and even smaller than two tax\n cuts passed under Barack Obama.Fact Checker rating:", "topic": "Taxes", "tweet_id": "924649059520073730"}, {"date": [30, 1], "text": "“Only\n 109 people out of 325,000 were detained and held for questioning. Big \nproblems at airports were caused by Delta computer outage,..... \nprotesters and the tears of Senator Schumer. Secretary Kelly said that \nall is going well with very few problems. MAKE AMERICA SAFE AGAIN!”", "analysis": "The\n Trump White House’s figures on the scope of the travel ban were \nludicrously low. The universe of people likely affected by the travel \nsuspension was around 60,000, according to the State Department  — not \n109. The White House later admitted the 109 figure reflected only the \nnumber of people who were affected by the ban and were in-flight at the \ntime the order was signed.Fact Checker rating:", "topic": "Immigration", "tweet_id": "826042483155013632"}, {"date": [30, 1], "text": "“If\n the ban were announced with a one week notice, the 'bad' would rush \ninto our country during that week. A lot of bad 'dudes' out there!”", "analysis": "It\n typically takes weeks or months to get a tourist visa to enter the \nUnited States. It certainly would take months for “bad guys,” presumably\n with records that would take longer for background checks, to receive a\n tourist visa.", "topic": "Immigration", "tweet_id": "826060143825666051"}, {"date": [30, 3], "text": "“The failing @nytimes has disgraced the media world. Gotten me wrong for two solid years. Change libel laws?”", "analysis": "The\n Times, like The Post, has seen spikes in audience and subscribers. \nMoreover, the day that Trump announced House Speaker Paul Ryan would be \npulling the Obamacare replacement bill, Trump personally called two \nreporters before speaking publicly: Robert Costa from The Post, and \nMaggie Haberman from the Times.", "topic": "Miscellaneous", "tweet_id": "847455180912181249"}, {"date": [30, 4], "text": "“Dems want billions to go to Insurance Companies to bail out donors.”", "analysis": "About\n two-thirds of donations made by insurance companies go to Republicans, \nnot Democrats, according to campaign finance records. Moreover, the \nfunds advanced in Obamacare go to help low-income voters afford health \ninsurance. ", "topic": "Health care", "tweet_id": "858659215451271168"}, {"date": [30, 5], "text": "“We\n have a MASSIVE trade deficit with Germany, plus they pay FAR LESS than \nthey should on NATO & military. Very bad for U.S. This will change”", "analysis": "Long\n before Trump became president, NATO had set a guideline of each member \nspending at least 2 percent of gross domestic product on defense -- by \n2024. Direct spending for NATO is governed by a formula based on each \nnation's gross national income — the total domestic and foreign output \nclaimed by residents of a country. With the largest economy in NATO, the\n United States pays the largest share — about 22 percent. Germany is \nsecond, with about 15 percent.Fact Checker rating:", "topic": "Foreign policy", "tweet_id": "869503804307275776"}, {"date": [30, 5], "text": "“The\n U.S. Senate should switch to 51 votes, immediately, and get Healthcare \nand TAX CUTS approved, fast and easy. Dems would do it, no doubt!”", "analysis": "Both\n items Trump references in this tweet would be done through the \nreconciliation process, a parliamentary procedure that only requires 51 \nvotes. ", "topic": "Miscellaneous", "tweet_id": "869553853750013953"}, {"date": [30, 6], "text": "“Watched\n low rated @Morning_Joe for first time in long time. FAKE NEWS. He \ncalled me to stop a National Enquirer article. I said no! Bad show”", "analysis": "Joe\n Scarborough and Mika Brzezinski dispute this account. They {wrote in an\n op-ed in The Washington Post}: \"This year, top White House staff \nmembers warned that the National Enquirer was planning to publish a \nnegative article about us unless we begged the president to have the \nstory spiked. We ignored their desperate pleas.\"", "topic": "Miscellaneous", "tweet_id": "880771685460344832"}, {"date": [30, 7], "text": "“Don't\n give up Republican Senators, the World is watching: Repeal & \nReplace...and go to 51 votes (nuke option), get Cross State Lines & \nmore.", "analysis": "The\n Senate was already working through the reconciliation process, which \nrequires a 51-vote majority, to pass the Obamacare repeal and replace \nbill.", "topic": "Health care", "tweet_id": "891623821702295552"}, {"date": [30, 8], "text": "“After\n witnessing first hand the horror & devastation caused by Hurricane \nHarvey,my heart goes out even more so to the great people of Texas!”", "analysis": "He got briefed by state and local officials about the situation on the ground -- the definition of second-hand.", "topic": "Miscellaneous", "tweet_id": "902881712010653697"}, {"date": [30, 8], "text": "“The U.S. has been talking to North Korea, and paying them extortion money, for 25 years. Talking is not the answer!”", "analysis": "The\n United States {stopped paying assistance} to North Korea after 2011, \nwith the exception of $1 million in humanitarian aid in January 2017 \nthat was negotiated by outgoing Secretary of State John Kerry just \nbefore Trump was inaugurated. ", "topic": "Foreign policy", "tweet_id": "902875515534626817"}, {"date": [30, 9], "text": "“In\n analyzing the Alabama Primary race,FAKE NEWS always fails to mention \nthat the candidate I endorsed went up MANY points after endorsement!”", "analysis": "Polling does not support Trump's claim that Luther Strange's chances improved after Trump's endorsement, {PolitiFact found.}", "topic": "Biographical record", "tweet_id": "914269704440737792"}, {"date": [30, 10], "text": "“Sorry, but this is years ago, before Paul Manafort was part of the Trump campaign.”", "analysis": "The\n indictment brought against Manafort, Trump's former campaign chairman, \nindicates illegal activity took place before, during and after \nManafort's stint as Trump campaign chairman. ", "topic": "Russia", "tweet_id": "925005659569041409"}, {"date": [30, 10], "text": "“Report out that Obama Campaign paid $972,000 to Fusion GPS. The firm also got $12,400,000 (really?) from DNC!”", "analysis": "Trump\n gets this completely mixed up. Perkins Coie, a law firm that worked for\n both the Democratic National Committee and the Clinton campaign, hired \nFusion GPS. The Obama campaign also hired Perkins Coie. But that did not\n translate into all funding for the law firm equaling funds for Fusion \nGPS -- or that the Obama campaign had any connection to Fusion. ", "topic": "Miscellaneous", "tweet_id": "924963492645437441"}, {"date": [31, 7], "text": "“If\n ObamaCare is hurting people, & it is, why shouldn’t it hurt the \ninsurance companies & why should Congress not be paying what public \npays?”", "analysis": "Members\n of Congress and most staff get health insurance via Obamacare, as they \nwere kicked off the Federal Employees Health Benefits Program when the \nlaw was implemented. Consistent with the FEHBP, the federal government \npays about 70 percent of the cost of premiums. ", "topic": "Health care", "tweet_id": "891996053611917312"}, {"date": [31, 7], "text": "“Highest\n Stock Market EVER, best economic numbers in years, unemployment lowest \nin 17 years, wages raising, border secure, S.C.: No WH chaos!”", "analysis": "This\n is a flip-flop for Trump. Trump equates the rise of the stock market \nsince the election as a demonstration of a good economy. But the stock \nmarket had already been rising for years before he was elected — and he \ncalled it “a big, fat, ugly bubble.” He also previously dismissed jobs \nnumbers as a phony statistic. ", "topic": "Economy", "tweet_id": "891998881009061888"}]